//
//  FairyTales.swift
//  HayLingo
//
//  Created by Karen Vardanian on 21.12.2024.
//

import Foundation

struct Tale: Identifiable {
    let id = UUID()
    let title: String
    let content: String
    let author: String?
    let timeToRead: Int
}

struct FairyTales {
    static let tales: [Tale] = [
        Tale(
            title: "ՈՒԼԻԿԸ",
            content: """
            1
             Խոր անտառում մի այծ է լինում։ Ունենում է մի գեղեցիկ ուլ։
             Ուլին ամեն օր թողնում է տանը, ինքը գնում է արոտ անելու։ Արածում է և իրիկունը կուրծքը լիքը տուն է գալիս։ Տուն է գալիս, դուռը զարկում ու մկկում, կանչում.
             Սևուկ ուլիկ,
             Սիրուն բալիկ,
             Ման եմ եկել սարե-սար,
             Կաթն եմ արել քեզ համար,
             Դռնակը բա՛ց, ներս գամ ես,
             Անուշ-անուշ ծիծ տամ քեզ.
             Սևուկ ուլիկ, Սիրուն բալիկ։
             Ուլիկն իսկույն վեր է թռչում, դուռը բաց անում։ Մայրը ծիծ է տալիս նրան ու կրկին գնում արոտ։
             2
             Էս բոլորը թաքուն տեսնում է գայլը։ Մի իրիկուն այծից առաջ գալիս է, դուռը զարկում ու իր հաստ ձայնով կանչում.
             Սևուկ ուլիկ,
             Սիրուն բալիկ,
             Ման եմ եկել սարե-սար,
             Կաթն եմ արել քեզ համար,
             Դռնակը բա՛ց, ներս գամ ես,
             Անուշ-անուշ ծիծ տամ քեզ.
             Սևուկ ուլիկ, Սիրուն բալիկ։
             Ուլիկը լսում է, լսում ու պատասխանում, «Էդ ո՞վ ես դու. չեմ ճանաչում։ Իմ մայրը էդպես չի կանչում։ Նա քաղցր ու բարակ ձայն ունի։ Քո ձայնը կոշտ է ու կոպիտ։ Դուռը բաց չե՛մ անի... Գնա՛... Չեմ ուզում քեզ...»
             Ու գայլը հեռանում է, գնում։
             3
             Գալիս է մայրը, դուռը ծեծում.
             Սևուկ ուլիկ,
             Սիրուն բալիկ,
             Ման եմ եկել սարե-սար,
             Կաթն եմ արել քեզ համար,
             Դռնակը բա՛ց, ներս գամ ես,
             Անուշ-անուշ ծիծ տամ քեզ.
             Սևուկ ուլիկ, Սիրուն բալիկ։
             Ուլիկը դուռը բաց է անում, ծիծ է ուտում ու մորը պատմում.
             — Գիտե՞ս, մայրի՛կ, ինչ եղավ։ Մի քիչ առաջ մինը եկավ, դուռը զարկեց ու կանչում էր.
             Սևուկ ուլիկ,
             Սիրուն բալիկ։
             Ասում էր՝ դուռը բա՛ց արա։ Էնպե՜ս հաստ ձայն ունե՛ր։ Էնպե՛ս վախեցա՛, էնպե՛ս վախեցա՛... Դուռը բաց չարի, ասի՝ չեմ ուզում, գնա՛...
             — Պա՛, պա՛, պա՛, պա՛, Սևուկ ջան, ի՛նչ լավ է եղել, որ բաց չես արել,— ասավ վախեցած մայրը։— Էդ գայլն է եղել, եկել է, որ քեզ ուտի։ Մյուս անգամ էլ որ գա, բաց չանես, ասա՝ գնա՛, թե չէ իմ մայրը քեզ կսպանի իր սուր պոզերով։
"""
            ,
            author: "Հովհաննես Թումանյան",
            timeToRead: 10
        ),
    ]
    
    static func getAllTales() -> [Tale] {
        tales
    }
}
