//
//  Tale.swift
//  HayLingo
//
//  Created by Karen Vardanian on 21.12.2024.
//

import Foundation

struct Tale: Identifiable {
    let id = UUID()
    let title: String
    let content: String
    let author: String?
    let timeToRead: Int
    let ageGroup: AgeGroup
    let tags: [String]
}

enum AgeGroup: String, CaseIterable {
    case preschool = "age_group_preschool"
    case elementary = "age_group_elementary"
    case teenager = "age_group_teenager"
    case adult = "age_group_adult"
    case all = "age_group_all"
    
    static let defaultAgeGroup: AgeGroup = .all
    
    var localizedString: String {
        return NSLocalizedString(self.rawValue, comment: "")
    }
}

struct FairyTales {
    static let tales: [Tale] = [
        Tale(
            title: "ՈՒԼԻԿԸ",
            content: """
            1
             Խոր անտառում մի այծ է լինում։ Ունենում է մի գեղեցիկ ուլ։
             Ուլին ամեն օր թողնում է տանը, ինքը գնում է արոտ անելու։ Արածում է և իրիկունը կուրծքը լիքը տուն է գալիս։ Տուն է գալիս, դուռը զարկում ու մկկում, կանչում.
             Սևուկ ուլիկ,
             Սիրուն բալիկ,
             Ման եմ եկել սարե-սար,
             Կաթն եմ արել քեզ համար,
             Դռնակը բա՛ց, ներս գամ ես,
             Անուշ-անուշ ծիծ տամ քեզ.
             Սևուկ ուլիկ, Սիրուն բալիկ։
             Ուլիկն իսկույն վեր է թռչում, դուռը բաց անում։ Մայրը ծիծ է տալիս նրան ու կրկին գնում արոտ։

             2
             Էս բոլորը թաքուն տեսնում է գայլը։ Մի իրիկուն այծից առաջ գալիս է, դուռը զարկում ու իր հաստ ձայնով կանչում.
             Սևուկ ուլիկ,
             Սիրուն բալիկ,
             Ման եմ եկել սարե-սար,
             Կաթն եմ արել քեզ համար,
             Դռնակը բա՛ց, ներս գամ ես,
             Անուշ-անուշ ծիծ տամ քեզ.
             Սևուկ ուլիկ, Սիրուն բալիկ։
             Ուլիկը լսում է, լսում ու պատասխանում, «Էդ ո՞վ ես դու. չեմ ճանաչում։ Իմ մայրը էդպես չի կանչում։ Նա քաղցր ու բարակ ձայն ունի։ Քո ձայնը կոշտ է ու կոպիտ։ Դուռը բաց չե՛մ անի... Գնա՛... Չեմ ուզում քեզ...»
             Ու գայլը հեռանում է, գնում։

             3
             Գալիս է մայրը, դուռը ծեծում.
             Սևուկ ուլիկ,
             Սիրուն բալիկ,
             Ման եմ եկել սարե-սար,
             Կաթն եմ արել քեզ համար,
             Դռնակը բա՛ց, ներս գամ ես,
             Անուշ-անուշ ծիծ տամ քեզ.
             Սևուկ ուլիկ, Սիրուն բալիկ։
             Ուլիկը դուռը բաց է անում, ծիծ է ուտում ու մորը պատմում.
             — Գիտե՞ս, մայրի՛կ, ինչ եղավ։ Մի քիչ առաջ մինը եկավ, դուռը զարկեց ու կանչում էր.
             Սևուկ ուլիկ,
             Սիրուն բալիկ։
             Ասում էր՝ դուռը բա՛ց արա։ Էնպե՜ս հաստ ձայն ունե՛ր։ Էնպե՛ս վախեցա՛, էնպե՛ս վախեցա՛... Դուռը բաց չարի, ասի՝ չեմ ուզում, գնա՛...
             — Պա՛, պա՛, պա՛, պա՛, Սևուկ ջան, ի՛նչ լավ է եղել, որ բաց չես արել,— ասավ վախեցած մայրը։— Էդ գայլն է եղել, եկել է, որ քեզ ուտի։ Մյուս անգամ էլ որ գա, բաց չանես, ասա՝ գնա՛, թե չէ իմ մայրը քեզ կսպանի իր սուր պոզերով։
"""
            ,
            author: "Հովհաննես Թումանյան",
            timeToRead: 15,
            ageGroup: .adult,
            tags: ["ՀԵՔԻԱԹ", "ՈՒԼԻԿ", "ԳԱՅԼ", "ԱՅԾ", "ԱՆՏԱՌ",]
        ),
        Tale(
            title: "ԵԴԵՄԱԿԱՆ ԾԱՂԻԿԸ",
            content: """
            Ժամանակով մեր աշխարհքում մի վաճառական է լինում։ Էս վաճառականը ունենում է մի աղջիկ՝ անունը Ծաղիկ։ Ծաղիկ որ ծաղիկ, էնքան քնքուշ, էնքան նախշուն, էնքան սիրուն է լինում։
            Հերը անչափ սիրելիս է լինում աղջկանը։ Մի անգամ էլ օտարության գնալիս հարցնում է.
            — Ի՞նչ կուզես քեզ համար բերեմ։— Թե՝ եդեմական ծաղիկը կուզեմ ինձ համար բերես։— Լավ, ասում է, կբերեմ։
            Գնում է աշխարհքից աշխարհք անց է կենում, իր առուտուրն անում է, իր գործը պրծնում, ուզում է աղջկա համար էլ եդեմական ծաղիկ գտնի, որ տուն գա։ Դես է հարցնում եդեմական ծաղիկ, դեն է հարցնում եդեմական ծաղիկ, ոչով չի իմանում, թե ինչ բան է եդեմական ծաղիկը կամ որտեղ է բացվում։ Վերջը մի ծեր մարդ է պատահում։ Էս ծեր մարդը մի ճամփա է ցույց տալի, ասում է էս ճամփով որ գնաս, էսինչ տեղը կգտնես քո հարցրած ծաղիկը։ Բայց զգույշ կաց Սպիտակ դևից, նա եդեմական ծաղկին հսկում է։
            Հոր սիրտ է։ Ծերունու ցույց տված ճամփեն բռնում է գնում։ Գնում է, գնում, շատ է գնում թե քիչ, դուրս է գալիս էնտեղ, որտեղ բացվում է եդեմական ծաղիկը։ Հենց հասնում է, ծաղիկը պոկում է թե չէ, մի հողմ, մի փոթորիկ է վեր կենում, փոթորկի հետ հայտնվում է մի հրեշ։ Մարդ ասես, մարդ չի, գազան ասես, գազան չի, բայց գազանի նման մռնչում է.
            — Ո՞ւր պոկեցիր իմ ծաղիկը... քո մահն է հիմի...
            — Քո մահն է հիմի...— ձեն է գալի ամեն կողմից... Մարդը ոչ մեռած, ոչ կենդանի՝ հրեշի առաջն է ընկնում։
            — Ներիր,— ասում է, — ո՛վ հզոր... իմ աղջիկն էր ուզել...
            — Կներեմ,— կանչում է հրեշը,— միայն էն պայմանով, որ էդ աղջիկը ինձ տաս։
            — Համաձայն եմ։
            — Որ համաձայն ես՝ քեզ եմ բաշխում քո կյանքը։ Գնա։ Հենց որ ձեր տան դիմացի սարն սպիտակի, էդ իմ նշանն է, կգամ Ծաղիկին տանելու։
            Դու մի ասիլ Սպիտակ դևը ինքը հրեշն է, որ կա։
            Վաճառականը վերադառնում է տուն։ Աղջիկը միամիտ առաջն է վազում, վզովը փաթաթվում։ Հերը համբուրում է՝ եդեմական ծաղիկը տալիս իրեն, իսկ պատահած դեպքն ու իր խոստումը թաքցնում է։ Թաքցնում է, բայց ինքն իր մեջ միտք է անում ու տխրում։ Քանի օրերն անց են կենում, էնքան ավելի է տխրում։ Մի առավոտ էլ վեր է կենում տեսնում իրենց տան դիմացի սարն արդեն սպիտակել է։ Լաց է լինում։ Պատճառը, հարցնում են. էլ չի կարողանում ծածկի, պատմում է, թե՝ հապա չեք ասիլ էսպես-էսպես բան է պատահել, ես էլ խոսք եմ տվել, հիմի Սպիտակ դևը գալու է Ծաղիկին տանի։
            — Բան չկա, հայրիկ,— ասում է Ծաղիկը,— դու լաց մի լինի, ես կերթամ Սպիտակ դևի հետ. ինչ կլինի կլինի։
            Այնինչ Սպիտակ դևը արդեն դուռը կտրել է ու մռնչում է.
            — Ո՜ւր է Ծաղիկն, ո՜ւր... ինձ տո՜ւր...
            Մռնչում է ու նրա սառը շնչից դողում են ծառերը, աշխարհքը գունատվում, ի՜նչ պետք է անեին խեղճ մարդիկը։ Զուգած, զարդարած, եդեմական ծաղիկը ձեռքին դուրս են բերում Ծաղիկին հանձնում են Սպիտակ դևին, որ չարախինդ սուլոցով ու ագահ ոռնոցով, սառով, սևով, հողմի թևով իսկույն հափշտակում է տանում։ Տանում է Մասիսի մեծ վիհը։ Հնտեղ, Մասիսի էն մեծ վիհում, էն անմատչելի, միշտ մռայլ ու միշտ սառն աշխարհքում կանգնած էր իր բյուրեղյա ապարանքը։ Էն ապարանքից իջնում էր նա, սառով ու սարսափով աշխարհքը պատում, հափշտակում տանում ամեն կյանք ու կենդանություն։ Ծաղիկին էլ տանում է, փակում են բյուրեղյա ապարանքում։
            Էսպես ամիսներ են անցկենում։ Մի անգամ էլ, գարնան սկզբին, երբ Սպիտակ դևը տանից դուրս է գնում, աղջիկը վեր է կենում փախչում։ Ետ է գալի դևը, տեսնում է՝ Ծաղիկը չկա։ Կատաղում է, հավաքում է իր բոլոր դիվական ուժն ու մրրիկի նման սուրալով, օձի նման սուլելով՝ ընկնում է ետևից։ Աղջիկը արդեն Արագածի ստորոտն է լինում հասած։ Ետ է նայում տեսնում է Սպիտակ դևը գալիս է։ Գալիս է, ո՜նց է գալիս, աստված ետ ու հեռու անի։ Սարսափից ճչում է, օգնություն է կանչում։ Կանչելու հետ, աստծու հրամանով, առաջը մի դուռն է բացվում։ Էն դռնովը մտնում է սարի մեջն, ու կրկին դուռը փակվում է դևի առաջին։
            Ավելի է կատաղում Սպիտակ դևը. իր լայն թևերով բամփում է Արագածի գագաթին ու մռնչում.
            — Ո՞ւր է Ծաղիկն, ո՛ւր... ինձ տո՛ւր...
            Սա էստեղ թող մռնչա, մենք գնանք Ծաղիկի ետևից, տեսնենք էն կախարդական դռնից որ մտավ, ինչ եղավ։
            Ծաղիկը էն կախարդական դռնից ներս է մտնում թե չէ, դուրս է գալի մի դրախտական այգի, որտեղ հազարավոր ձայներ երգում են.
            Զմրուխտ պալատում, ոսկի դագաղում,
            Պառկած է չարի ուժով կախարդված,
            Պառկած է Արին ոչ մեռած, ոչ քուն,
            Ու աշխարհքն ամեն սև սուգ է մտած։
            Պառկած է մինչև օրը ցանկալի,
            Էն պայծառ օրը, երբ որ նա կըգա,
            Կըգա նոր կյանքով ու նոր սիրով լի,
            Կարտասվի անուշ ու համբույր կըտա։
            Առաջ է գնում Ծաղիկը, հանկարծ այգին լցվում է զվարթ աղմուկով ու տարածվում են ուրախ երգի ձայները.
            Ահա եկավ, հասավ չքնաղ
            Իր թագուհին, իր սիրելին,
            Հիմի կելնի պաղ դագաղից
            Մեր քաջ Արին-Արմանելին։
            Հիմի կելնի թագավորը,
            Հզոր Արին-Արմանելին,
            Ու կըժպտան վառ աչքերը
            Ողջ աշխարհքին, ծաղկին, ծըլին։
            Հիմի կընկնի կախարդանքը
            Չար թշնամու, Սպիտակ դևի,
            Հիմի կըգա դալար կյանքը,
            Բույրը ծաղկի, շողն արևի։
            Եվ ճիշտ որ, Ծաղիկը գնում է, ինչ է տեսնում, այգու մեջ մի զմրուխտ պալատ, պալատի մեջ ոսկի դագաղ, դագաղի մեջ մի ջահել, գեղեցիկ երիտասարդ, որ ոչ քնած է, ոչ մեռած, շունչը վրեն հազիվ տրըփում է։ Տեսնում է թե չէ, սիրտը փուլ է գալի, էլ չի դիմանում, լաց է լինում ու կռանում է համբուրում։ Արտասուքի կաթիլներն ընկնում են երիտասարդի երեսին, երիտասարդը հանկարծ բաց է անում աչքերն ու վեր է կենում կանգնում, ինչպես էն դրախտում բուսած սոսիներից մինը։
            Դու մի՛ ասիլ՝ հենց ինքը Արին-Արմանելին է, որ կա։
            — Ո՞վ ես դու, սիրուն աղջիկ,— հարցնում է Արին-Արմանելին,— և ինչպես ընկար էս աշխարհքը։
            Ու Ծաղիկը կանգնում պատմում է իր գլխին եկածը, թե ինչպես ինքը գերի էր եղած Սպիտակ դևին, որ այժմ էլ ետևիցն է ընկել ու հալածում է իրեն։
            — Լսում եմ, լսում եմ նրա դաժան ձայնը,— պատասխանում է Արին-Արմանելին։— Ինձ էլ նա է կախարդել ամիսներ առաջ ու գցել էս մահանման քնի մեջ։ Էսպես է անում ամեն տարի։ Պետք է էսպես էլ մնայի, մինչև մինը խորտակեր նրա չար կախարդանքը։ Դու եղար էդ մինը։ Այժմ ես դուրս կգնամ նրա դեմ։
            Ասելն ու անելը մին է լինում։ Առնում է կայծակի թուրը ու դուրս է գալի։ Երկու թշնամի ուժերը պատառում են իրար, բացվում է օրհասակռիվը։ Զարկում են զարկվում, երկինք ու գետինք իրար են խառնվում։ Մութն ամպերում մռնչում է Սպիտակ դևը, Արին-Արմանելին ահավոր որոտում ու շողացնում է կայծակի թուրը, երկիրը դողում, դղրդում է հիմքից։ Կռվի վերջում պարտված–զարկված Սպիտակ դևը վշշալով ու թշշալով, լացով ու թացով քաշվում է նորից իր մռայլ թագավորությունը, Մասիսի էն մեծ վիհը, դարձյալ փակվում է իր բյուրեղյա սառն ապարանքում։ Աշխարհքը մնում է գեղեցիկ հաղթողին։
            Ու աստվածային հանդես է բացվում Արաքսի հովտում։ Արին-Արմանելին պսակվում է Ծաղիկի հետ։ Բնությունը առատորեն փռում է իր փարթամ վարդերն ու զարդերը, ինս ու ջինս, մրջյուն ու թռչուն իրար են խառնում իրենց զվարթ աղմուկն ու աղաղակը, խաղն ու տաղը, ամենի վրա հոյակապ կամար է կապում կանաչ-կարմիրը՝ ծիածանը, իսկ նրանց վերև ճառագում ու աշխարհքովը մի ժպտում է գարնան կենսատու արևը։
            Ու էսպես կրկնվում է ամեն տարի, որովհետև ամեն տարի Սպիտակ դևը կախարդում է Արին-Արմանելիին ու հափշտակում է սիրուն Ծաղիկին։
            """
            ,
            author: "Հովհաննես Թումանյան",
            timeToRead: 30,
            ageGroup: .adult,
            tags: ["ՀԵՔԻԱԹ", "ՀՐԵՇ", "ԿԱԽԱՐԴԱՑՈՒՄ", "ՍԻՐՈՒԹՅՈՒՆ", "ՆԱՊԱՍՏԱԿ"]
        ),
        Tale(
            title: "ՔԵՖ ԱՆՈՂԻՆ ՔԵՖ ՉԻ ՊԱԿՍՒԼ",
            content: """
            Ա
            Ժամանակով Բաղդադ քաղաքում նստում էր Հարուն Ալ Ռաշիդ թագավորը։ Հարուն ալ Ռաշիդ թագավորը սովորություն ուներ՝ շորերը փոխած ման էր գալիս, իմանալու, թե ինչ է կատարվում իր մայրաքաղաքում։ Մի գիշեր էլ էսպես, դերվիշի շոր մտած, անցնելիս է լինում մի խուլ փողոցով։ Մի աղքատ տնակից երգի ու նվագածության ձայներ է լսում։ Կանգ է առնում, միտք է անում միտք, հետաքրքրվում է ու ներս մտնում։ Ներս է մտնում տեսնում՝ դատարկ ու մերկ մի տնակ, կրակի դեմը փռած կարպետի վրա նստոտած տան տերն ու երաժիշտները։ Աղքատ ընթրիքի շուրջը բոլորած նվագում են, երգում ու զվարճանում։
            — Խաղաղություն ձեզ, ո՛վ ուրախ մարդիկ,— ողջունում է դերվիշն ու խոնարհություն է անում տան տիրոջը։
            — Բարով եկար, դերվիշ բաբա, համեցեք, միասին ուտենք աստծու տված մի կտոր հացն ու միասին ուրախանանք,— խնդրում է տան տերը։ Դերվիշին էլ նստեցնում են իրենց հետ ու շարունակում են քեֆը։
            Գիշերվա մի ժամին տան տերը երաժիշտներին վճարում է իրենց հասանելիքն ու ճամփու դնում։ Երբ երաժիշտները հեռանում են, դերվիշը տան տիրոջը հարցնում է.
            — Անունդ ի՞նչ է, բարեկամ։
            — Հասան։
            — Ամոթ չլինի հարցնելը, Հասան ախպեր, ի՞նչ արվեստի տեր ես դու, ի՜նչքան փող ես աշխատում, որ էսպես քեֆով ես անցկացնում քո ժամանակը։
            — Քեֆը շատ փողով չի լինում, դերվիշ բաբա,— պատասխանում է տան տերը։— Ամենաչնչին ապրուստն էլ կարող է մարդ ուրախ վայելել։ Ես մի փինաչի եմ, չուստեր եմ կարկատում, օրը մի չնչին բան եմ վաստակում։ Երեկոները բերում եմ մի մասը ապրուստի եմ տալիս, մյուս մասն էլ էս երաժիշտներին, որ տեսար։ Նստում ենք, ուրախանում։ Թե քեզ նման մի ազնիվ հյուր էլ աստված հասցնում է՝ ավելի լավ։
            — Անպակաս լինի քո ուրախությունը, ո՛վ Հասան, բայց եթե հանկարծ աշխատանքիդ էդ բարակ աղբյուրն էլ կտրի, ի՞նչ պիտի անես։
            —Ինչո՞ւ է կտրում, դերվիշ բաբա:
            — Օրինակ, թագավոր է ու թագավորի քմահաճույք. հանկարծ հրաման արավ, որ էլ փինաչիությունը չպիտի լինի։
            — Է՜հ, թագավորի դարդը կտրե՞լ է ընկնի փինաչիների ետևից... կամ ի՞նչ են արել նրան փինաչիները։ Երբ էդպես բան կպատահի, էն ժամանակ կմտածենք, այժմ քնենք, դերվիշ բաբա։ Աստված ողորմած է. քեֆ անոդին քեֆ չի պակսիլ։ Աշխարհքի բան է՝ ինչպես բռնես՝ էնպես էլ կերթա։
            — Լա´վ, աստված տա, որ էդպես լինի,— բարեմաղթում է դերվիշն, ու քնում են։
            Բ
            Առավոտը վաղ դերվիշը գնում է։ Նրա գնալուց հետո մունետիկները լցվում են Բաղդադի փողոցներն ու հրապարակները, գոռալով հայտարարում, թե՝ թագավորի հրամանն է, փինաչիների խանութները փակ պիտի մնան. էսօրվանից էլ ոչ ոք իրավունք չունի էդ արհեստով պարապելու։ Զանցառուների գլուխները կթռչեն։
            Խեղճ Հասանի ձեռքից էլ բիզը խլում են, վզակոթին տալով դուրս անում իր նեղլիկ խանութից ու դուռը փակում։
            Մյուս գիշերը, դարձյալ դերվիշի շոր մտած, Հարուն Ալ Ռաշիդ թագավորը գնում է քաղաք շրջելու։ Դարձյալ անցնում է էն փողոցով, ուր ապրում էր ուրախ Հասանը։ Դարձյալ երգի ու երաժշտության ձայներ է լսում նրա տանից։ Ներս է մտնում։
            — Օ՜, բարով, բարով, դերվիշ բաբա, համեցեք, նստիր քո տեղը։
            Նստում են, ուտում, խմում, ածում, երգում, ուրախանում մինչև կեսգիշեր։
            Կեսգիշերին երաժիշտներն իրենց վարձն առնում են հեռանում։ Մնում են տան տերն ու հյուրը։
            — Գիտե՞ս ինչ պատահեց, դերվիշ բաբա։
            — Ի՞նչ պատահեց։
            — Հենց էն, ինչ որ դու գուշակեցիր երեկ իրիկուն։ Էսօր թագավորը հրաման հանեց՝ մեր արհեստն արգելեց...
            — Ի՞նչ ես ասում,— զարմանում է հյուրը։ — Հապա ո՞րտեղից փող գտար, որ էս գիշեր էլ քեֆ սարքեցիր։
            — Մի կավե կուժ եմ գտել, հիմի էլ ջուր եմ ծախում։ Օրական ինչ աշխատում եմ՝ մի մասը տալիս եմ ապրուստի, մյուսը երաժիշտներին ու դարձյալ քեֆ եմ անում։
            — Իսկ եթե թագավորը ջուր ծախելն էլ արգելի, էն ժամանակ ի՞նչ ես անելու։
            — Ջուր ծախելով թագավորին ի՞նչ վնաս ենք տալի, որ արգելի։ Եվ ինչո՞ւ էսօրվանից դարդ անեմ դրա համար։ Երբ որ կարգելի, էն ժամանակ կմտածեմ։ Մի՛ վախենար, բարեկամ, երբեք չի պակսիլ մի կտոր հաց ու մի անկյուն, որ ես էնտեղ ուրախանամ։
            — Անպակաս լինի ուրախությունը քո օջախից, ով Հասան,— բարեմաղթում է դերվիշն ու հեռանում։
            Գ
            Առավոտը վաղ ամբողջ Բադդադը թնդում է մունետիկների ձենից, թե Հարուն Ալ Ռաշիդ թագավորն էսպես է հրամայում. ջուրը աստծունն է և էսօրվանից ոչ ոք իրավունք չունի փողով ծախելու։ Պատռել բոլոր ջրկիրների տիկերն ու ջարդել նրանց կժերը։
            Աղքատ Հասանի կուժն էլ ջարդում են ջրի ճամփին ու դատարկ ետ ղրկում։
            Մյուս գիշեր թագավորը կրկին դերվիշի շոր է հագնում ու գնում քաղաքը շրջելու։ Կրկին մոտենում է ուրախ Հասանի տանը։ Դարձյալ ուրախության և երգի ձայներ։ Ներս է մտնում։
            — Ա՛յ, դերվիշ բաբա, համեցե՜ք, համեցե՜ք, նստիր քո տեղը, քեֆ անենք, ցերեկը երկարացնենք, գիշերը կարճացնենք։ Ուրախանանք, դերվիշ բաբա, ավելի լավ է ուրախանալ, քան տրտմել։
            — Իհարկե, ուրախությունը ավելի լավ է։ Ամենքս էլ մեռնելու ենք, ո՛վ կարող է թող ուրախանա,— բացականչում է դերվիշն ու նստում ձասանի կողքին։
            Գիշերվա մի ժամին երգիչներն իրենց վարձն առնում են ու հեռանում։ Մնում են դերվիշն ու տան տերը։
            — Հասան ախպեր, էսօր ի՛նչ լսեցի, ասում են թագավորը արգելել է ջուր ծախելը, ճշմարի՞տ է արդյոք։
            — Ի՜նչպես չէ, ի՜նչպես չէ, ամենքիս ջրի ամաններն էլ ոչնչացրին։ Ա՛խպեր, դու կատարյալ մարգարե ես եղել, ինչ ասում ես՝ մյուս օրը կատարվում է։
            — Հապա ի՞նչպես է, որ դու դարձյալ քեֆ ես անում։ Ո՞րտեղից ես գտել էս փողը։
            — Երանի թե մարդու պակասը փողը լինի։ Փողի գտնելը հեշտ է, դերվիշ բաբա։ Գնացի մի գործատիրոջ մշակ մտա. օրական մի բան է տալիս, բերում եմ մի մասը ապրուստիս եմ անում, մյուսը երաժիշտներին եմ տալիս ու շարունակում եմ իմ քեֆը։ Բանը մարդու սիրտն է, դերվիշ բաբա։
            — Ես իմ հոգին, արժե, որ էդ սրտով թագավորի պալատական լինեիր դու, —բացականչեց դերվիշը։
            — Վա´հ, դերվիշ, քո ասածները կատարվում են ճշտությամբ, հիմի որ էս խոսքդ էլ կատարվի՞։
            — Ինչո՞ւ չի կատարվի, աշխարհքում անկարելի բան չկա,— պատասխանեց դերվիշն ու բաժանվեցին։
            Դ
            Առավոտը վաղ տերության պաշտոնյաները կտրեցին Հասանի աղքատ տնակի դուռը.
            — Էստե՞ղ է կենում քեֆ սիրող Հասանը։
            — Ես եմ,— պատասխանեց զարմացած Հասանը։
            — Թագավորի հրամանով հետևիր մեզ։
            Ուղիղ պալատը տարան Հասանին։ Հայտնեցին, որ թագավորն իրեն պալատականի պաշտոն է տվել։ Պալատականի զգեստ հագցրին, մի թուր էլ կապեցին մեջքը ու կանգնեցրին պալատի մուտքերից մեկի առջև։ Ամբողջ օրը էն մուտքի առջև պարապ կանգնեց Հասանը։ Իրիկունը որ մթնեց, դատարկ ճամփու դրին տուն, թե՝ գնա, առավոտը ետ կգաս քո տեղը կանգնելու։
            Գիշերը դարձյալ դերվիշի շոր մտավ Հարուն Ալ Ռաշիդ թագավորն ու գնաց քաղաքը շրջելու։
            Գնաց մոտեցավ Հասանի տանը։ Ականջ դրեց։ Զարմանքով լսեց, որ դարձյալ հնչում են երգն ու երաժշտությունը։ Հասանը քեֆ է անում դարձյալ։ Ներս մտավ։
            — Դերվի՜շ, դերվի՜շ, քո տունը չքանդվի, արի է՛, երեկվա խոսքդ էլ կատարվեց, թագավորն ինձ պալատում պաշտոն է տվել։
            — Ի՞նչ ես ասում։
            — Աստված վկա։
            — Եվ երևի շատ փող է տվել...
            — Չէ՜, ինչ փող. մի գրոշ չտվին։ Դատարկ տուն ղրկեցին։
            — Հապա որտեղի՞ց ես փող գտել, որ դարձյալ քեֆ ես անում։
            — Նստի՛ր, ասեմ որտեղից։ Մի թուր են կապել մեջքս։ Իրիկունը տուն գալիս մտածեցի, թե՝ հո ես մարդ չեմ սպանելու։ Տարա պողպատի շեղբը (մեջը) ծախեցի, պողպատի փոխարեն փայտե շինել տվի, մեջը դրի, եկա տուն։ Եկա պողպատի փողով քեֆ սարքեցի։ Լավ եմ արել, չէ՞, դերվիշ, ավելի լավ է ուրախություն ունենալ, քան մարդ սպանելու սուր։
            — Հա´, հա´, հա´,— ծիծաղեց դերվիշը։— Լավ անելը՝ լավ ես արել, Հասան, բայց եթե էգուց քեզ թագավորը հրամայի, թե՝ կտրի էս հանցավորի գլուխը՝ ի՞նչ ես անելու։
            — Բերանդ բարի բաց արա, ա՛յ չարագուշակ դերվիշ,— բարկացավ Հասանը։ — Հակառակի նման ինչ էլ ասում ես, կատարվում է. չե՞ս կարող մի լավ բան ասել...
            Ու շատ վշտացավ Հասանը։ Սիրտը երկյուղ ընկավ, ամբողջ գիշերը չկարողացավ քնի։
            Իրավ որ, մյուս օրը թագավորը կանչեց Հասանին ու ամբողջ արքունիքի առջև հանդիսավոր հրամայեց, որ մի հանցավորի գլուխը կտրի։
            — Հանիր թուրդ ու կտրի էս հանցավորի գլուխը։
            — Ապրած կենաս, մեծ թագավոր,— պատասխանեց սարսափած Հասանը,— ես իմ օրում մարդու գլուխ չեմ կտրել, չեմ կարող։ Փորձված մարդիկ շատ կան քո պալատում, հրամայիր մի ուրիշը կտրի...
            — Ես քեզ եմ հրամայում,— սաստեց թագավորը,— եթե մի վայրկյան էլ ուշացրիր, գլուխդ կթռչի։ Հանի՛ր թուրդ...
            Էս խոսքի հետ թշվառ Հասանը մոտեցավ հանցավորին, ձեռքերը տարածեց ու աղաղակեց դեպի երկինք.
            — Տեր աստված, արդարն ու մեղավորը դու գիտես։ Եթե էս մարդը մեղավոր է, ինձ ուժ տուր, որ մի զարկով թռցնեմ սրա գլուխը, իսկ եթե արդար է, թող փայտ դառնա իմ թուրը..
            Ասավ, դուրս քաշեց թուրը... Փա՜յտ։ Հրաշքի վրա պալատականները մնացին ապշած։ Էստեղ ձարուն Ալ Ռաշիդ թագավորը փառ-փառ ծիծաղեց ու ամեն բան բաց արավ, պատմեց իր պալատականների առջև։ Շատ ծիծաղեցին պալատականները ու շատ գովեցին թե՛ ուրախություն սիրող Հասանին, թե՛ թագավորին։ Ծիծաղեց մինչև անգամ էն դժբախտ հանցավորը, որ չոքած, վիզը մեկնած սպասում էր թրի զարկին։ Թագավորը բաշխեց հանցավորին իր կյանքը, իսկ Հասանին դառնալով՝ հռչակեց նրան իր սիրելի մարդը ամբողջ տերության մեջ ու լավ պաշտոն տվեց, որ միշտ աշխատի ու անպակաս ուրախ ապրի, ուրիշներին էլ սովորեցնի ուրախ ապրել աշխարհքում։
"""
            ,
            author: "Հովհաննես Թումանյան",
            timeToRead: 35,
            ageGroup: .adult,
            tags: ["ՀԵՔԻԱԹ", "ՀՐԵՇ", "ԿԱԽԱՐԴԱՑՈՒՄ", "ՍԻՐՈՒԹՅՈՒՆ", "ՆԱՊԱՍՏԱԿ"]
            
        ),
        Tale(
            title: "ԱՌՅՈՒԾԸ, ԱՐՋԸ ԵՎ ԳԱՅԼԸԱՌՅՈՒԾԸ, ԱՐՋԸ ԵՎ ԳԱՅԼԸ",
            content: """
           Առյուծը, արջը և գայլը մի անգամ ասացին.
            
           — Մենք ինչո՞ւ ենք հում ուտում մե՛ր որսը։ Մարդկանցից մեկին բռնենք, որ, իրենց սովորույթի համաձայն, կերակուր պատրաստի մեզ համար մեր որսից։
            
           Եվ բռնեցին մեկին ու կարգեցին խոհարար։
            
           Մարդը նեղվելով նրանց ձեռքի տակ մնալուց՝ հնար մտածեց ազատվելու ճեղքեց մի մեծ գերան և նրա ամեն կողմում սեպեր դնելով՝ ասաց առյուծին ու մյուսներին.
            
           — Օգնեցե՛ք ինձ ճեղքելու այս փայտը։ Դրե՛ք ձեր ձեռքերը ճեղքվածքի մեջ և ձգեցե՛ք։
            
           Երբ նրանք դրին ձեռքերը, մարդը դուրս քաշեց սեպերը։ Գազանները մնացին կաշկանդված։ Այդ ժամանակ մարդը կացինն առավ և ասաց.
            
           Նախ առյուծից սկսենք։
            
           Ասաց և ջարդեց բոլորին։
"""
            ,
            author: "Մխիթար Գոշ",
            timeToRead: 10,
            ageGroup: .teenager,
            tags: ["ՀԵՔԻԱԹ", "ԲՆՈՒԹՅՈՒՆ", "ԽԱՂԱՋՈՒՆ", "ԽԱՉՈՒԹՅՈՒՆ", "ԽԱՂԱՋԻ ՀՈՐՀՈՒՄ", "ՈՐՍ"]
        ),
        Tale(
            title: "ՊՈՉԱՏ ԱՂՎԵՍԸ",
            content: """
            Լինում է, չի լինում՝ մի պառավ։ Էս պառավն իր էծը կթում է, կաթը վեր է դնում, գնում է ցախ ու փետ բերի, որ կրակ անի, կաթն եփի;
            Մի աղվես գալիս է, գլուխը կոխում կաթնի ամանը, կաթն ուտում.
            Պառավը վրա է հասնում, ցաքատով տալիս է, աղվեսի պոչը կտրում։
            Պոչատ աղվեսը փախչում է, գնում է մի քարի վրա կանգնում է ու էսպես խնդրում.
            — Տատիկ, տատիկ, պոչս տուր, կցեմ-կցմցեմ, գնամ ընկերներիս հասնեմ, որ ինձ չասեն՝ պոչատ աղվես, ո՞րտեղ էիր։
            Պառավն ասում է.
            — Դե գնա իմ կաթը բեր։
            Աղվեսը գնում է կովի մոտ։
            — Կովիկ, կովիկ, կա՛թ տուր ինձ, կաթը տանեմ պառավին տամ, պառավը պոչս տա, կցեմ-կցմցեմ, գնամ ընկերներիս հասնեմ, որ ինձ չասեն՝ պոչատ աղվես, ո՞րտեղ էիր։
            Կովն ասում է.
            — Դե գնա ինձ համար խոտ բեր։ Աղվեսը գնում է արտի մոտ։
            — Արտիկ, արտիկ, խո՛տ տուր ինձ, խոտը տանեմ կովին տամ, կովը ինձ կաթ տա, կաթը տանեմ պառավին տամ, պառավը պոչս տա, կցեմ-կցմցեմ, գնամ ընկերներիս հասնեմ, որ ինձ չասեն՝ պոչատ աղվես, ո՞րտեղ էիր։ Արտն ասում է.
            — Դե գնա ինձ համար ջուր բեր։
            Աղվեսը գնում է աղբյուրի մոտ։
            — Աղբյուր, աղբյուր, ջո՛ւր տուր ինձ, ջուրը տանեմ արտին տամ, արտը ինձ խոտ տա, խոտը տանեմ կովին տամ, կովը ինձ կաթ տա, կաթը տանեմ պառավին տամ, պառավը պոչս տա, կցեմ-կցմցեմ, գնամ ընկերներիս հասնեմ, որ ինձ չասեն՝ պոչատ աղվես, ո՞րտեղ էիր։
            Աղբյուրն ասում է.
            — Դե գնա կուժ բեր։
            Աղվեսը գնում է աղջկա մոտ։
            — Աղջի՛կ, աղջիկ, կուժդ տուր, կուժը տանեմ աղբյուրին տամ, աղբյուրը ինձ ջուր տա, ջուրը տանեմ արտին տամ, արտը ինձ խոտ տա, խոտը տանեմ կովին տամ, կովը ինձ կաթ տա, կաթը տանեմ պառավին տամ, պառավը պոչս տա, կցեմ-կցմցեմ, գնամ ընկերներ՛իս հասնեմ, որ ինձ չասեն՝ պոչատ աղվես, ո՞րտեղ էիր։
            Աղջիկն ասում է.
            — Դե գնա ուլունք բեր ինձ համար։
            Աղվեսը գնում է չարչու մոտ։
            — Չարչի, չարչի, ուլո՛ւնք տուր, ուլունքը տանեմ աղջկան տամ, աղջիկը ինձ կուժ տա, կուժը տանեմ աղբյուրին տամ, աղբյուրը ինձ ջուր տա, ջուրը տանեմ արտին տամ, արտը ինձ խոտ տա, խոտը տանեմ կովին տամ, կովը ինձ կաթ տա, կաթը տանեմ պառավին տամ, պառավը պոչս տա, կցեմ-կցմցեմ, գնամ ընկերներիս հասնեմ, որ ինձ չասեն՝ պոչատ աղվես, ո՞րտեղ էիր։
            Չարչին ասում է.
            — Դե գնա ինձ համար ձու բեր։
            Աղվեսը գնում է հավի մոտ։
            — Հավիկ, հավիկ, ձու-ձու տուր, ձու-ձուն տանեմ չարչուն տամ, չարչին ինձ ուլունք տա, ուլունքը տանեմ աղջկան տամ, աղջիկն ինձ կուժ տա. կուժը տանեմ աղբյուրին տամ, աղբյուրը ինձ շուր տա. ջուրը տանեմ արտին տամ, արտը ինձ խոտ տա. խոտը տանեմ կովին տամ, կովը ինձ կաթ տա. կաթը տանեմ պառավին տամ, պառավը պոչս տա, կցեմ-կցմցեմ, գնամ ընկերներիս հասնեմ, որ ինձ չասեն՝ պոչատ աղվես, ո՞րտեղ էիր։
            Հավն ասում է.
            — Դե գնա ինձ համար կուտ բեր։
            Աղվեսը գնում է կալվորի մոտ։
            — Կալվոր, կալվոր, կո՛ւտ տուր ինձ, կուտը տանեմ հավին տամ. հավը ինձ ձու տա, ձուն տանեմ չարչուն տամ, չարչին ինձ ուլունք տա, ուլունքը տանեմ աղջկան տամ, աղջիկն ինձ կուժ տա, կուժը տանեմ աղբյուրին տամ, աղբյուրը ինձ ջուր տա, ջուրը տանեմ արտին տամ, արտը ինձ խոտ տա, խոտը տանեմ կովին տամ, կովը ինձ կաթ տա, կաթը տանեմ պառավին տամ, պառավը պոչս տա. կցեմ-կցմցեմ, գնամ ընկերներիս հասնեմ, որ ինձ չասեն՝ պոչատ աղվես, ո՞րտեղ էիր։
            Կալվորի մեղքը գալիս է. մի բուռ կուտ է տալիս։ Աղվեսը կուտը տանում է հավին, հավը ձու է տալի, ձուն տանում է չարչուն, չարչին ուլունք է տալի, ուլունքը տանում է աղջկան, աղջիկը կուժ է տալի, կուժը տանում է աղբյուրին, աղբյուրը ջուր է տալի, ջուրը տանում է արտին, արտը խոտ է տալի, խոտը տանում է կովին, կովը կաթ է տալի, կաթը տանում է տալի պառավին, պառավը պոչը տալիս է իրեն, կցում է, կցմցո՛ւմ, վազում է գնում, իր ընկերներին հասնում։
             
"""
            ,
            author: "Հովհաննես Թումանյան",
            timeToRead: 25,
            ageGroup: .all,
            tags: ["ՀԵՔԻԱԹ", "ԲՆՈՒԹՅՈՒՆ", "ԽԱՂԱՋՈՒՆ", "ԽԱՉՈՒԹՅՈՒՆ", "ՍԵՌԱՍՏԱՆՈՒԹՅՈՒՆ", "ԲԱՐԵԿԱՐԳՈՒԹՅՈՒՆ", "ԽԵՂՈՒԹՅՈՒՆ"]
        ),
        Tale(
            title: "ԱՆԽԵԼՔ ՀԻՄԱՐԸ",
            content: """
            Ժամանակով մի աղքատ մարդ կար. որքան աշխատում էր, որքան չարչարվում էր, դարձյալ միևնույն աղքատն էր մնում։
            Հուսահատված մի օր նա վեր կացավ, թե՝ պետք է գնամ գտնեմ աստծուն, տեսնեմ ես երբ պետք է պրծնեմ այս աղքատությունից ու ինձ համար մի բան խնդրեմ։
            Ճանապարհին մի գայլ պատահեց.
            — Առաջ բարի, մարդ-ախպեր, ո՞ւր ես գնում,— հարցրեց գայլը։
            «Գնում եմ աստծու մոտ,— պատասխանեց աղքատը,— դարդ ունեմ ասելու»։
            — Դե որ գնաս աստծու մոտ,— խնդրեց գայլը,— ասա մի սոված գայլ կա, գիշեր-ցերեկ ման է գալիս սար ու ձոր, ուտելու բան չի գտնում, ասա՛ մինչև ե՞րբ պետք է սոված մնա. որ ստեղծել ես՝ ինչո՞ւ չես կերակուր հասցնում։
            «Լա՛վ»,— ասաց մարդն ու շարունակեց ճանապարհը։ Շատ գնաց թե քիչ, պատահեց մի սիրուն սոջկա։
            — Ո՞ւր ես գնում, ախպեր,— հարցրեց աղջիկը։
            «Գնում եմ աստծու մոտ»։
            — Երբ որ աստծուն տեսնես,— աղաչեց սիրուն աղջիկը,— ասա այսպիսի մի աղջիկ կա՝ ջահել, առողջ, հարուստ, բայց չի կարողանում ուրախանալ, բախտավոր զգալ իրան, ի՞նչ պիտի լինի նրա ճարը։
            «Կասեմ»,— խոստացավ ճամփորդն ու գնաց, պատահեց մի ծառի, որ թեև ջրափին էր կանգնած, բայց չոր էր։
            — Ո՞ւր ես գնում, ա՛յ ճամփորդ,— հարցրեց չոր ծառը։ «Գնում եմ աստծու մոտ»։
            — Դե կանգնի՛ր, մի երկու խոսք էլ ես ապսպրեմ,— խնդրեց չոր ծառը,— աստծուն, կասես, այս ի՞նչ բան է, բուսել եմ այս պարզ ջրի ափին, բայց ամառ-ձմեռ չոր եմ մնում, ե՞րբ պետք է ես էլ կանաչեմ։
            Այս էլ լսեց աղքատն ու շարունակեց ճանապարհը։
            Այնքան գնաց մինչև, գտավ աստծուն։ Մի բարձր ժայռի տակ, մեջքը ժայռին դեմ տված, ալևոր մարդու կերպարանքով նստած էր աստվածը։
            «Բարի օր»,— ասաց աղքատն ու կանգնեց աստծու առաջին։
            — Բարով եկար,— պատասխանեց աստված,— ի՞նչ ես ուզում։
            «Էն եմ ուզում, որ ամեն մարդի էլ հավասար աչքով մտիկ անես, մեկին ավար չանես, մյուսին խավար, ես այնքան եմ տանջվում, աշխատում եմ, էլ չեմ կարողանում կուշտ փորով հաց գտնեմ, իսկ շատերը, որ իմ կեսի չափ էլ չեն աշխատում, հարուստ ու հանգիստ ապրում են»։
            — Դե գնա, հիմի կհարստանաս, քո բախտը տվեցի, գնա վայելի՛ր,-ասաց աստված։
            «Էլ բան ունեմ ասելու, տե՛ր»,— ասաց աղքատն ու պատմեց սոված գայլի, սիրուն աղջկա ու չոր ծառի ապսպրանքը։
            Աստված բոլորի պատասխանը տվեց, և աղքատը շնորհակալություն արավ ու հեռացավ։
            Վերադարձին պատահեց չոր ծառին։
            — Ինձ համար ի՞նչ ասաց աստված — հարցրեց չոր ծառը։ «Ասաց, քո տակին ոսկի կա. մինչև այդ ոսկին չհանեն, որ արմատներդ հողին հասնի, դու չես կանաչիլ»,— պատմեց մարդը։
            — Էլ ո՞ւր ես գնում, արի՛ ոսկին հանիր էլի, համ քեզ օգուտ կլինի, համ ինձ, դու կհարստանաս, ես էլ կկանաչեմ։
            «Չէ՛, ես ժամանակ չունեմ, շտապում եմ,— պատասխանեց աղքատը,— աստված ինձ բախտ տվեց, ես շուտով պետք է գնամ իմ բախտը գտնեմ, վայելեմ»,— ասաց ու գնաց։
            Հետո սիրուն աղջիկը պատահեց ու ճամփորդի առաջը կտրեց.
            — Ի՞նչ լուր բերիր ինձ համար։
            «Աստված ասաց՝ դու պիտի քեզ համար մի մտերիմ կյանքի ընկեր գտնես, այն ժամանակ էլ տխուր չես լինիլ, ուրախ ու երջանիկ կլինես»։
            — Դե որ այդպես է, արի՛ դու եղիր իմ կյանքի մտերիմ ընկերը,— թախանձեց աղջիկը ճամփորդին։
            «Չէ՛, ես քեզ ընկերակցելու ժամանակ չունեմ, աստված ինձ բախտ է տվել, պետք է գնամ իմ բախտը գտնեմ, վայելեմ»,— ասաց աղքատն ու հեռացավ։
            Ճանապարհին սպասում էր սոված գայլը, հեռվից հենց որ տեսավ ճամփորդին, վազեց առաջը կտրեց։
            — Հը, աստված ի՞նչ ասաց։
            «Ախպեր, աստծու մոտ գնալիս քեզանից հետո մի սիրուն աղջիկ ու մի չոր ծառ էլ պատահեցին, աղջիկն ապսպրեց, թե ինչու ինքը չի կարողանում ուրախանալ, ծառն էլ թե՝ ինչո՞ւ է գարուն, ամառ չոր։ Աստծուն պատմեցի, ասաց՝ աղջկանն ասա իրան համար մի կյանքի ընկեր գտնի՝ կբախտավորվի, ծառին էլ ասա, քո տակին ոսկի կա, պետք է այդ ոսկին հանեն, արմատներդ հողին հասնեն, որ կանաչես։ Եկա իրանց պատմեցի աստծու խոսքերը, ծառն ասաց, դե արի, հանիր ոսկին տար, աղջիկն էլ թե՝ ես հենց քեզ եմ ընտրում ինձ ընկեր։ Ասացի, չէ՛, ախպեր, չեմ կարող, աստված ինձ բախտ է տվել, պետք է գնամ իմ բախտը գտնեմ, վայելեմ»։
            — Իսկ ինձ համար ի՞նչ ասաց աստված,— հարցրեց սոված գայլը։
            «Քեզ համար էլ ասաց՝ սոված ման կգաս՝ մինչև մի անխելք մարդ կգտնես, կուտես, կկշտանաս»։
            — Էլ քեզանից անխելք մարդ ո՞րտեղից գտնեմ, որ ուտեմ,— ասաց գայլն ու կերավ անխելք աղքատին։
"""
            ,
            author: "Հովհաննես Թումանյան",
            timeToRead: 20,
            ageGroup: .all,
            tags: ["ՍՈՎ", "ԱՍՏՎԱԾ", "ԲԱՃՏ", "ԲԱՐՈՒԹՅՈՒՆ", "ԷՋՄԻԱԾԻՆ", "ԿՅԱՆՔԻ ԴԱՍԵՐ", "ԿՅԱՆՔԻ ՃԱՆԱՊԱՐՀ", "ՊԱՏՄՈՒԹՅՈՒՆ", "ՀԱՐԱԲԵՐՈՒԹՅՈՒՆՆԵՐ"]

        ),
        Tale(
            title: "ԽԵԼՈՔՆ ՈՒ ՀԻՄԱՐԸ",
            content: """
             Երկու ախպեր են լինում, մինը խելոք, մյուսը հիմար։ Խելոք ախպերը միշտ բանեցնում ու չարչարում է հիմարին։ Էնքան չարչարում է, որ հիմարը հուսահատվում է, մի օր էլ կանգնում է, թե՝
             — Ախպեր, էլ չեմ ուզում քեզ հետ կենամ, բաժանվում եմ. իմ բաժինը տուր, գնամ ջոկ ապրեմ։
             — Լա՛վ,— ասում է խելոքը.— էսօր էլ դու ապրանքը ջուրը տար, ես կերը տամ. երբ ջրից բերես, ո՛ր ապրանքը գոմը մտնի, ինձ, որը դուրս մնա՝ քեզ։
             Ժամանակն էլ լինում է ձմեռ։
             Հիմարը համաձայնում է։ Ապրանքը ջուրն է տանում ետ բերում։ Ձմեովա ցուրտ օր, մրսած անասուններ, հենց տաք գոմի դուռն են հասնում թե չէ՝ իրար ետևից ներս են թափում։ Դռանը մնում է մի հիվանդ քոսոտ մոզի՝ գերաններին քոր անելիս։ Էն է մնում հիմարին։
             Էս թիմարը թոկը վիզն է կապում, իր մոզին տանում ծախելու։
             — Ա՛ մոզի, արի, հե՜յ,— կանչելով գնում է։
             Մի հին ավերակի մոտից անցնելիս էլ որ ձեն է տալի՝ ա՛ մոզի, արի, հեյ... ավերակի արձագանքը կրկնում է.
             — Հե՜յ... հիմարը կանգնում է։
             — Ինձ հետ ես խոսում, հա՞...
             Ավերակը ձայն է տալիս.
             — Հա՜...
             — Մոզին ուզում ե՞ս։
             — Ե՜ս...
             — Քա՞նի մանեթ կտաս։
             — Տա՜ս...
             — Հիմի կտա՞ս, թե չէ։
             — Չէ՜...
             — Դե էգուց կգամ, որտեղից որ է՝ ճարի՜։
             — Արի՜...
             Հիմարը համաձայնում է ու մոզին ծախված համարելով՝ ավերակի դռանը կապում է, շվշվացնելով վերադառնում տուն։
             Մյուս օրը առավոտը վաղ վեր է կենում գնում փողերն առնելու։ Դու մի՛ ասիլ՝ գիշերը գայլերը մոզին կերել են։ Գնում է տեսնում՝ ոսկորները դես ու դեն ցրված ավերակի առջև։
             — Հը՜,— ասում է,— մորթել ես կերել, հա՜։
             — Հա՜...
             — Չաղ է՞ր, թե չէ։
             — Չէ՜։
             Հիմարը էստեղ վախենում է, կարծում է ավերակի մտքումը կա, որ իր փողը չտա։
             — Էդ իմ բանը չի,— ասում է,— առել ես պրծել, ես իմ փողի տերն եմ, բեր իմ փողը՝ տասը մանեթ դեղին ոսկի՜...
             — Սկի՜ ...
             Էս էլ որ լսում է հիմարը, բարկանում է, ձեռի փետը ետ է տանում, տուր թե կտաս, ավերակի խարխուլ պատերին։ Մին, երկու զարկում է. պատերից մի քանի քար են վեր ընկնում։ Դու մի ասիլ՝ հնուց էդ պատում գանձ է եղել պահած։ Քարերը որ վեր են ընկնում՝ ոսկին թափում է հանկարծ առաջը՝ լցվում։
             — Այ էդպես... բայց էսքանն ի՞նչ եմ անում, տասը մանեթ ես պարտ, իմ տասը մանեթը տուր, մնացածը քու փողն է, ընչի՞ս է պետք...
             Մի ոսկի է վերցնում, գալի տուն։
             — Հը՜, մոզիդ ծախեցի՞ր,— ծիծաղելով հարցնում է խելոք ախպերը։
             — Ծախեցի։
             — Ո՞ւմ վրա։
             — Ավերակի։
             — Հետո, փող տվա՞վ։
             — Իհարկե տվավ։ Դեռ չէր ուզում տա, ամա ձեռիս փետովը որ մի քանի հասցրի, ինչ ուներ՝ առաջիս փռեց։ Իմ տասը մանեթը վեր կալա, մնացածն իրենն էր, հենց թողեցի էնպես փռված։
             Ասում է ու ոսկին հանում ցույց տալիս։
             — Էդ ո՞րտեղ է,— աչքերը չորս է անում խելոք ախպերը։
             — է´հ, ցույց չեմ տալ, դու աչքածակ ես, էնքան կհավաքես, շալակս կտաս, որ մեջքս կկոտրի։
             Խելոքը երդվում է, որ մենակ ինքը կշալակի, միայն թե տեղը ցույց տա։
             — Բեր,— ասում է,— ձեռինդ էլ ինձ տուր, մնացածի տեղն էլ ցույց տուր, որ ես տեսնեմ տկլոր ես, քեզ համար նոր շորեր առնեմ։
             Հիմարը նոր շորերի անունը որ լսում է՝ ձեռինն էլ է տալիս ախպորը, տանում է մնացածի տեղն էլ ցույց տալի։ Խելոքը ոսկին հավաքում է, բերում տուն, հարստանում, բայց ախպոր համար նոր շորեր չի առնում։
             Էս հիմարը ասում է, ասում է, որ տեսնում է չի լինում, գնում է դատավորի մոտ գանգատ։
             — Պարոն դատավոր,— ասում է,— ես մի մոզի ունեի, տարա ավերակի վրա ծախեցի...
             — Հերիք է, հերիք,— ընդհատում է դատավորը.— էս հիմարը ո՞րտեղից եկավ, ո՜նց թե մոզին ավերակի վրա ծախեցի...— վրեն ծիծաղում է ու դուրս անում։
             Գնում է ուրիշներին գանգատվում, նրանք էլ էն վրեն ծիծաղում։
             Ու ասում են, մինչև էսօր էլ խեղճ հիմարը կիսամերկ ման է գալի, պատահողին գանգատվում, բայց ոչ ոք չի հավատում, ամենքն էլ ծիծաղում են վրեն, իսկ խելոք ախպերն էլ ծիծաղում է ամենքի հետ։
"""
            ,
            author: "Հովհաննես Թումանյան",
            timeToRead: 20,
            ageGroup: .adult,
            tags: ["ԽԵԼՈՔ", "ԻՄԱՐ", "ԱՎԵՐԱԿ", "ՈՍԿԻ", "ԲԱՑՈՒՄ", "ՏԱՍՆԵՐ", "ՎՐԵՆ ԾԻԾԱԽԵԼՈՒ", "ՈՒՍՈՒՄ", "ԴԱՏԱՎՈՐ", "ԳԱՆԳԱՏ", "ՀԱՐԱԲԵՐՈՒԹՅՈՒՆ", "ՇՈՐԵՐ", "ԲԱՃԱՌՈՒՄ"]

        ),
        Tale(
            title: "ՁԱԽՈՐԴ ՓԱՆՈՍԸ",
            content: """
            Ժամանակով մի աղքատ մարդ է լինում, անունը Փանոս։ Ինքը մի բարի մարդ է լինում, բայց ինչ գործ որ բռնում է՝ ձախ է գնում։ Դրա համար էլ անունը դնում են Ձախորդ Փանոս։ Ունեցած-չունեցածը մի լուծ եզն է լինում, մի սել ու մի կացին։
            Մի օր եզները սելում լծում է, կացինը առնում գնում անտառը փետի։ Անտառում էս Փանոսը միտք է անում, թե՝ մի բան որ ծառը կտրելուց ետը մին էլ նեղություն պետք է քաշեմ՝ ահագին գերանը գետնից բարձրացնեմ գցեմ սելի մեջը, ավելի լավ է՝ հենց սելը լծած բերեմ ծառի տակին կանգնեցնեմ, որ ծառը կտրեմ թե չէ, ընկնի մեջը։
            Ասածն արած է։
            Եզներով սելը բերում է մի մեծ ծառի ներքև կանգնեցնում, ինքը անցնում է վերի կողմը, կացինը քաշում՝ թրխկ, հա թրխկ։ Շատ է քաշում թե քիչ, էդ էլ ինքը կիմանա, ծառը ճռճռալով գալիս է զարկում, տակովն անում սելը ջարդում, եզներն էլ հետը։ Փանոսը մնում է ապշած կանգնած։ Ի՞նչ պետք է անի։ Կացինը վերցնում է ու ծոծրակը քորելով ճամփա է ընկնում դեպի տուն։
            Ճամփին մի լճի ափով անց կենալիս է լինում։ Տեսնում է մեջը վայրի բադեր են լողում։ Ասում է՝ գլուխը քարը, չեղավ չեղավ, արի գոնե մի բադ սպանեմ, տանեմ տամ կնկանս։ Ասում է ու կացինը պտտում, շպրտում դեպի բադերը, որ մինն սպանի, բադերը ճղճղալով ցրվում են, փախչում են, որը եղեգնուտն է մտնում, որը թռչում գնում, կացինն էլ ընկնում է լճի խոր տեղը, տակն անում, կորչում։ Փանոսը մնում է լճի ափին կանգնած միտք անելիս։ Ի՞նչ անի, ի՞նչ չանի։ Շորերը հանում է դնում լճի ափին, ինքը մտնում մեջը, որ կացինը հանի։ Գնում է, գնում, քանի առաջ է գնում, ջուրն էնքան խորանում է, տեսնում է կարող է խեղդվել, ետ է դառնում, դուրս գալի։
            Դու մի՛ ասիլ՝ Փանոսը որ լիճն է մտնում ու խորը գնում, էդ ժամանակ լճափով մի անցկենող է լինում, տեսնում է էստեղ թափած շորեր կան, եղեգնուտի մեջ խորը գնացած Փանոսին էլ չի նկատում, էս շորերը հավաքում է, առնում գնում։
            Փանոսը լճից դուրս է գալի, տեսնում շոր չկա։ Մնում է տկլոր կանգնած։
            Միտք է անում. «Ի՜նչ անեմ, տեր աստված, էսպես տկլոր ո՜ւր գնամ»։
            Սպասում է մինչև մութն ընկնի։ Մթան հետ վեր է կենում գնում գյուղը։ Որ գյուղին մոտենում է, ասում է՝ էսպես տկլոր որ գնամ մեր տունը, տանըցիք ի՞նչ կասեն։ Արի գնամ ախպորիցս շոր առնեմ հագնեմ՝ էնպես գնամ կնկանս մոտ։
            Ճամփեն ծռում է դեպի ախպոր տունը։
            Դո´ւ. մի ասիլ՝ էդ գիշեր էլ ախպոր մոտ մեծարք կա, քեֆի էլ էն տաք ժամանակն է։ Դուռը ծերպ է անում, տեսնի ով կա, ով չկա, հյուրերից մինը կարծում է, թե շունն է, ձեռի կրծած ոսկորը շպրտում է դեպի դուռը, ոսկորը դիպչում է աչքին, աչքը հանում։
            Փանոսը ցավից վայ՜վայ անելով ետ է դառնում, շներն էս ձենի վրա վեր են կենում, տեսնում են, օհո՛, մթնումը հրես մի տկլոր օքմին, ու չորս կողմից վրա են տալիս։ Շների հաչոցի վրա մարդիկ դուրս են թափվում, տեսնում են՝ մի տկլոր մարդ փախած գնում է, շները ետևից։ Առանց երկար ու բարակ մտածելու վճռում են, որ կա թե չկա սա սատանա է։
            Բավական տեղ ղըչըղու տալով, հայհոյելով, հարայ-հրոցով ընկնում են ետևից, հալածում, տանում գցում անտառները։
            Շներն էլ ետևիցը մի ճուռը պոկում են, ու էսպես տկլոր, աչքը հանած, կաղին տալով՝ խեղճ Փանոսը գնում է կորչում։
            Մյուս օրը գյուղում տարածվում է, թե հապա չեք ասիլ՝ «Փանոսը կորել է։ Գնացել է անտառը փետի ու ետ չի եկել»։ Գեղահավան հավաքվում են գնում, գնում են անտառը ման գալի, սելն ու եզները գտնում են ծառի տակին ջարդված, ինքը չկա։
            Դես Փանոս, դեն Փանոս. հարց ու փորձով հագուստն էլ գտնում են մեկի մոտ։
            — Ա՛յ մարդ, էս հագուստը ո՞րտեղից է ընկել քեզ մոտ։
            — Թե՝ ախպեր, էս հագուստը էսպես մի լճի ափին վեր ածած էր, հավաքեցի բերի։
            Գնում են լճի չորս կողմը պտտում, կանչում՝ «Փանո՜ս, Փանո՜ս», Փանոսը չկա։
            Վճռում են որ Փանոսը խեղդվել է։
            Գալիս են ժամ ու պատարագ են անում, քելեխը տալիս։ Կնիկն էլ մի քիչ սուգ է անում, Փանոսին գովում, ափսոսում, հետո մի ուրիշ մարդ է ուզում, հետը պսակվում գնում։
"""
            ,
            author: "Հովհաննես Թումանյան",
            timeToRead: 25,
            ageGroup: .adult,
            tags: ["ՁԱԽՈՐԴ ՓԱՆՈՍ", "ԲԱՐԻ ՄԱՐԴ", "ԱՆՏԱՌ", "ԿԱՑԻՆ", "ԼՃԻ", "ՎԱՐԺ", "ՇՆԵՐ", "ՏԿԼՈՐ", "ՀԱՂՈՐԴՈՒԹՅՈՒՆ", "ՔԵՖ", "ԱԽՊԵՐ", "ԿՈՌԵԼՈՒ", "ԿՈՒՐԱՑՈՒՄ", "ԴԱՏԱՎՈՐ", "ՀԱՅՀՈՅԵԼՈՒ"]
        ),
        Tale(
            title: "ԾԻՏԸ",
            content: """
           Լինում է, չի լինում մի ծիտ։
           Մի անգամ էս ծտի ոտը փուշ է մտնում։ Դես է թռչում, դեն է թռչում, տեսնում է՝ մի պառավ փետի է ման գալի, թոնիր վառի, հաց թխի։ Ասում է.
           — Նանի ջան, նանի, ոտիս փուշը հանի, թոնիրդ վառի, ես էլ գնամ քուջուջ անեմ, գլուխս պահեմ։
           Պառավը փուշը հանում է, թոնիրը վառում։ Ծիտը գնում է, ետ գալի, թե՝ փուշը ետ տուր ինձ։
           Պառավն ասում է.
           — Փուշը թոնիրն եմ գցել։
           Ծիտը կանգնում է, թե՝
           — Իմ փուշը տուր, թե չէ դես թռչեմ, դեն թռչեմ, լոշիկդ առնեմ, դուրս թռչեմ։
           Պառավը մի լոշ է տալի։ Ծիտը լոշն առնում է թռչում։ Գնում է տեսնում՝ մի հովիվ անհաց կաթն է ուտում։ Ասում է.
           — Հովիվ ախպեր, կաթն ինչո՞ւ ես. անհաց ուտում։ Ա՛յ լոշը ա՛ռ, կաթնի մեջ բրդի՛, կե՛ր, ես էլ գնամ քուջուջ անեմ, գլուխս պահեմ։
           Գնում է, ետ գալի, թե՝ լոշս տուր։
           Հովիվն ասում է.
           — Կերա։
           — Չէ՛,— ասում է,— իմ լոշը տուր, թե չէ դես թռչեմ, դեն թռչեմ, գառնիկդ առնեմ, դուրս թռչեմ։
           Հովիվը ճարահատած մի գառն է տալի։ Առնում է թռչում։ Գնում է տեսնում՝ մի տեղ հարսանիք են անում, մսացու չունեն, որ մորթեն։ Ասում է.
           — Ի՞նչ եք մոլորել։ Ա´յ, իմ գառն առեք, մորթեցեք, քեֆ արեք։ Ես էլ գնամ քուջուջ անեմ, գլուխս պլստեմ։
           Գնում է, գալի, թե՝ իմ գառը տվեք։
           Ասում են.
           — Մորթել ենք կերել, ո՞րտեղից տանք։
           Սա կանգնում է, թե՝ չէ, իմ գառը տալիս եք՝ տվեք, թե չէ՝ դես թռչեմ, դեն թռչեմ, հարսին առնեմ, դուրս թռչեմ։
           Ու հարսին առնում է թռչում։
           Գնում է, գնում, գնում է տեսնում՝ մի աշուղ մի ճամփով գնում է։
           Ասում է.
           — Աշուղ ախպեր, առ էս հարսին պահի քեզ մոտ։ Ես էլ գնամ քուջուջ անեմ, գլուխս պահեմ։
           Գնում է, ետ գալի աշուղի առաջը կտրում, թե՝ իմ հարսը ինձ տուր։
           Աշուղը ասում է.
           — Հարսը գնաց իրենց տուն։
           Սա թե՝ չէ, իմ հարսը տուր, թե չէ՝ դես թռչեմ, դեն թռչեմ, սազիկդ առնեմ դուրս թռչեմ։
           Աշուղը սազը տալիս է իրեն։
           Սազն առնում է, ուսը գցում, թռչում, մի տեղ նստում է, սկսում է ածել ու ճըտվըտալով երգել.
           Ծընգլը, մընգլը,
           Փուշիկ տվի, լոշիկ առա,
           Լոշիկ տվի, գառնիկ առա,
           Գառնիկ տվի, հարսիկ առա,
           Հարսիկ տվի, սազիկ առա,
           Սազիկ առա, աշուղ դառա,
           Ծընգլը, մընգլը,
           Ծի՜վ, ծի՜վ։
"""
            ,
            author: "Հովհաննես Թումանյան",
            timeToRead: 15,
            ageGroup: .teenager,
            tags: ["ԾԻՏ", "ՓՈՒՇ", "ՊԱՌԱՎ", "ԼՈՇ", "ՀՈՎԻՎ", "ԳԱՌՆ"]
        ),
        Tale(
            title: "Հեքիաթ իսկական ընկերության մասին",
            content: """
            Վաղուց-վաղուց, խոր անտառի սրտում, մի ծեր սոճու ստվերում ապրում էր ոզնի Զորին՝ իր փոքրիկ բնում։ Նա մի նուրբ, մոխրագույն ոզնի էր՝ ծուռումուռ ոտքերով ու մեջքին անթիվ փշերով զարդարված։ Անտառի բնակիչներից ոչ ոք չէր սիրում Զորիին, և ոչ մի կենդանի չէր ցանկանում բարեկամանալ նրա հետ։

            – Տե՛ս, թե ինչքան հմայիչ ու քնքուշ է իմ պոչը։ Ինչպե՞ս կարող եմ ընկերություն անել քեզ պես գորշ ու փշոտ արարածի հետ,- ասաց աղվեսը կտրուկ։

            – Դու չափազանց փոքրիկ ես։ Վախենում եմ՝ կարող եմ քեզ ոտքի տակ գցել անզգուշությամբ,- մրթմրթաց արջը։

            – Դու այնքա՜ն անճոռնի ես։ Չեմ կարող քեզ հետ ցատկոտել ու վազվզել,- շշնջաց նապաստակը։

            – Ո՛չ ձայն ունես, ո՛չ լսողություն։ Նույնիսկ ճահճի գորտերն ավելի լավ են երգում, քան դու,- ծաղրեց սարյակը։

            Խեղճ Զորին խորապես վիրավորվեց նման դաժան խոսքերից։ Նա երկար նստեց անտառի լճակի ափին ու դիտեց իր արտացոլանքը ջրի հայելում։

            – Ինչո՞ւ եմ ես այսքան փոքր, այսքան փշոտ ու տգեղ։ Ինչո՞ւ չունեմ երաժշտական ունակություններ,- հեկեկում էր նա արցունքներն աչքերին։

            Ոզնու փոքրիկ արցունքները զրնգում էին լճի մակերեսին, բայց ոչ ոք չկար, ով կգթար նրան։ Զորին այնքան տխուր ու մտահոգված էր իր մենակությունից, որ քիչ էր մնում հիվանդանար։

            Մի գեղեցիկ առավոտ Զորին, ինչպես միշտ, ուղևորվեց դեպի անտառի մարգագետինը՝ սնկեր ու հատապտուղներ հավաքելու նախաճաշի համար։ Նա դանդաղ քայլում էր արահետով՝ խորասուզված իր մռայլ մտքերի մեջ, երբ հանկարծ նրա կողքով սլացավ մի աղվես, և քիչ մնաց, որ տրորեր նրան։ Զորին նայեց շուրջբոլորը և նկատեց, որ որսորդը հետապնդում է աղվեսին՝ հրացանը ձեռքին։ Ոզնու սիրտը լցվեց սարսափով։

            «Որսորդն այնքան հսկա է, իսկ ես՝ այսքան աննշան»,- անցավ նրա մտքով։ Բայց չնայած սարսափին, Զորին, առանց վայրկյան իսկ տատանվելու, կծկվեց գնդակի նման ու նետվեց որսորդի ոտքերի տակ։

            Որսորդը սայթաքեց ոզնու սուր փշերի վրա ու ընկավ գետնին։ Մինչ նա կկանգներ ոտքի, աղվեսը հասցրեց դիմել փախուստի, իսկ Զորին շտապեց թաքնվել մացառուտում։ Այնտեղ, սարսափից դողալով, ոզնին սպասեց մինչև որսորդի հեռանալը։ Միայն երեկոյան, ցավից կաղալով, նա քայլեց դեպի իր բույնը։ Աղվեսին ազատելիս նա վնասել էր թաթը, և հիմա ամեն քայլ նրա համար տանջալից էր։ Երբ Զորին վերջապես հասավ իր ծեր սոճուն, աղվեսն արդեն այնտեղ սպասում էր նրան։

            – Շնորհակալ եմ, սիրելի՛ Զորի։ Դու չափազանց քաջ ես։ Անտառի բոլոր բնակիչները սարսափած էին որսորդից ու թաքնվել էին իրենց բներում։ Ոչ ոք չհամարձակվեց ինձ օգնության հասնել, բայց դու անվախ կանգնեցիր ու փրկեցիր կյանքս։ Դու իսկական ընկեր ես,- ասաց աղվեսը սրտանց։

            Այդ օրվանից ոզնին ու աղվեսը դարձան անբաժան ընկերներ։ Աղվեսը հոգ էր տանում Զորիի մասին, բերում նրան դեղաբույսեր, սնկեր ու հատապտուղներ, քանի դեռ ոզնու վիրավոր թաթը ցավում էր ու դժվարացնում նրա քայլքը։

            Զորին արագ ապաքինվեց, քանզի այլևս միայնակ չէր։ Այժմ նա ուներ մի հավատարիմ ընկեր։


            Ի վերջո, իսկական բարեկամը նա չէ, ով ունի գեղեցիկ պոչ, հրաշալի ձայն կամ արագ է վազում։ Իրական ընկերը նա է, ով չի լքի ձեզ դժվարին պահին և չի հեռանա, երբ օգնության կարիք ունեք։

            Եվ այսպես, ոզնի Զորին ու աղվեսը դարձան անբաժան ընկերներ՝ միշտ պատրաստ լինելով օգնել միմյանց ամեն իրավիճակում։ Նրանք միասին զբոսնում էին անտառում, կիսում իրենց ուրախություններն ու վշտերը, և վայելում իրենց ընկերության ջերմությունը։

            Զորիի պատմությունը դարձավ անտառի բոլոր բնակիչների սիրելի հեքիաթը։ Այն սովորեցնում էր, որ արտաքինը խաբուսիկ է, և որ իսկական ընկերությունը գալիս է սրտի խորքից։ Կենդանիները հասկացան, որ չպետք է դատել ուրիշներին ըստ արտաքինի, այլ պետք է գնահատել նրանց ներքին աշխարհն ու բնավորությունը։

            Ոզնին այլևս երբեք իրեն միայնակ ու լքված չզգաց։ Նա գտել էր իր հավատարիմ ընկերոջը, ով միշտ կանգնած էր իր կողքին։ Եվ թեև Զորին դեռ փոքրիկ էր ու փշոտ, նա այլևս չէր ամաչում իր արտաքինից, քանզի հասկացել էր, որ կարևորը սիրտն է, այլ ոչ թե արտաքինը։
             
"""
            ,
            author: "Լավ հեքիաթներ",
            timeToRead: 15,
            ageGroup: .elementary,
            tags: ["ԱՂՎԵՍ","ՈԶՆԻ","ՀԵՔԻԱԹ","ԸՆԿԵՐՈՒԹՅՈՒՆ"]
        ),
        Tale(
            title: "Ամեն փայլող բան գանձ չէ",
            content: """
            Առավոտյան արթնացավ գծավոր Վագրիկն ու որոշեց գանձ փնտրել։ Գնաց իր ընկերոջ՝ Գորտիկի մոտ։
            – Գորտի՛կ, արի՛ գնանք գանձ փնտրելու,- ասաց նա։
            – Իսկ ի՞նչ է գանձը,- հարցրեց Գորտիկը։
            – Դե՜… դա երևի այն է, ինչ բոլորը փնտրում են։
            Իրականում, Վագրիկը ևս չգիտեր, թե ինչ է գանձը, բայց դրա մասին շատ էր կարդացել գրքերում։
            – Եկ Ոզնիին էլ կանչենք, երեքով ուրախ կլինի,- առաջարկեց Գորտիկը, ու նրանք գնացին Ոզնու մոտ։
            – Օ՜, գանձ… Ես լսել եմ, որ գանձը լինում է կանաչ բացատներում՝ մեծ ծառի տակ,- ասաց Ոզնին։
            Եվ ընկերները գնացին բացատ՝ մեծ ծառի մոտ։ Նրանք ծառի շուրջը պտտվեցին մի անգամ, հետո էլի, երրորդ անգամ… բայց գանձ ոչ մի տեղ չկար։
            Ծառի կատարին Սկյուռիկն էր նստած։
            – Այդ ի՞նչ եք անում,- հարցրեց նա։
            – Գանձ ենք փնտրում։
            – Հա՜-հա՜,- ծիծաղեց Սկյուռիկը։- Գանձը գետնի տակ են թաղում։
            – Գետնի տա՞կ,- զարմացան ընկերները։
            Ու սկսեցին հողը փորել։ Ծառի տակ փոս փորեցին ու ինչ-որ բանի դիպան. դա հեքիաթների մի մեծ գիրք էր։
            Ընկերները բացեցին գիրքն ու սկսեցին կարդալ։ Հեքիաթներն այնքան լավն ու բարի էին, որ Վագրիկը, Գորտիկն ու Ոզնին մինչև երեկո հետաքրքրությամբ կարդում էին այն։ Նույնիսկ Սկյուռիկը ծառից ցած իջավ, որ լսի այդ հեքիաթները։
            Երբ սկսեց մթնել, ընկերները պատրաստվեցին տուն գնալ։
            – Իսկ ի՞նչ ենք անելու այս գանձը։ Ո՞վ էր այն թաղել։
            Հարևան ծառին Ագռավն էր նստած։
            – Ղա՜ռռռ։ Այն Փորսուղը թաղեց, երբ մեծացավ։ Ասեց, երբ ինքը երեխաներ ունենա, գանձը կհանի գետնի տակից ու այն կկարդա իր երեխաների համար։ Ու մոռացավ գանձի մասին,- ասաց Ագռավը։
            Ընկերները գնացին քեռի Փորսուղի մոտ։ Երբ Փորսուղը տեսավ հեքիաթների գիրքը, շատ ուրախացավ։
            – Շնորհակալ եմ շատ։ Ես մոռացել էի այս գանձի մասին։ Կարծում եմ, իմ բալիկներին այս գիրքը շատ դուր կգա։ Դուք էլ հյուր եկեք մեզ, միասին հեքիաթներ կարդանք։ Իսկ հիմա ուշ է ու ձեր քնելու ժամն է։
            Վագրիկը, Գորտիկն ու Ոզնին հրաժեշտ տվեցին Փորսուղին ու գնացին իրենց տները։ Նրանք ընթրեցին, մաքրեցին ատամներն ու պառկեցին քնելու։ Եվ գեղեցիկ ու բարի հեքիաթներ տեսան երազում։
"""
            ,
            author: "Լավ հեքիաթներ",
            timeToRead: 10,
            ageGroup: .elementary,
            tags: ["ԳԱՆՁ","ԳԻՐՔ","ՀԵՔԻԱԹ","ՎԱԳՐ"]
        ),
        Tale(
            title: "Փոքրիկ հրաշամանուկը",
            content: """
           Լոլան ընտանիքի միակ աղջիկն էր, ընտանիքի միակ զավակը՝ մայրիկի և հայրիկի սիրելին:


           Տասը տարին նոր էր բոլորել և այդ տարիների ընթացքում հասցրել էր հասկանալ, որ տան միակ ուրախությունն է՝ հայրիկի աննման բալիկը, մայրիկի՝ չքնաղ արքայադուստրը: Չնայած տասը տարեկան էր, բայց հայրիկը նրան գրկում, օրորում էր, նրա հետ տարբեր մուլտեր նայում, կատարում բոլոր քմահաճույքները: Մայրիկն էլ ամեն օր երես էր տալիս նրան բազմազան համեղ ուտեստներով, քաղցրիկ կոնֆետներով: Գրեթե ամեն երեկո դուրս էին գալիս միասին զբոսնելու, և վերադառնում տուն՝ ժպիտը դեմքներին, էներգիայով լեզուն, արկածներով բազմազան: Այդպես անցնում էին օրերը: Մի առավոտ մայրիկը սովորականի պես համբույրով չարթնացրեց իրեն, այն հարցին, թե ինչու՞ մայրիկը այդպես վարվեց՝ Լոլան ստացավ հետևյալ պատասխանը. «Մայրիկը մի փոքր վատառողջ է, պետք է մայրիկին թողնենք հանգստանա, որ մեր տուն բերի քո փոքրիկ եղբորը, և դու այլևս միայնակ չես լինի՝ լիքը կխաղաք, կզբոսնեք, կպարեք, ֆիլմեր կդիտեք: Ուղղակի նա կգա մի քանի ամիս հետո»: Լոլան լսեց հոր խոսքերը, իհարկե ոչինչ չհասկացավ, բայց, այնուամենայնիվ, խոստացավ մայրիկին շատ չտանջել: Օրերն անցնում էին սովորականի պես: Ճիշտ է, մայրիկն առաջվա առույգը չէր ու մի փոքր էլ գիրացել էր, բայց Լոլան երջանիկ էր և սիրված: Մի օր էլ մայրիկը բացակայեց տանից: Հայրիկն էլ Լոլային ասաց.

           – Լո՛լա, աղջի՛կս, դու արդեն մենակ չես լինի, մայրիկը գնացել է փոքրիկ եղբորդ ետևից: Որպես մեծ, դու պետք է սիրես, փայփայես, օգնես ու միշտ լինես նրա կողքին. չէ՞ որ ինչ ցանես, այն էլ կհնձես՝ բարի, սրտացավ, կամեցող, օգնող լինես և դա էլ նրանից կստանաս:

           Լոլան կապույտ աչուկները ճպճպացրեց և մեծին հատուկ կարգապահությամբ ասաց.

           – Լսում եմ, հայրի՛կ, իսկ նա ե՞րբ է գալու:

           Հայրիկը գրկեց Լոլային և ասաց.

           -Երեք օրից, աղջի՛կս: Մենք այդ երեք օրվա ընթացքում շատ գործ ունենք անելու, սենյակը պետք է պատրաստենք, փուչիկները փչենք, համեղ քաղցրավենիքներ պատրաստենք՝ չէ՞ որ մեր ընտանիքի նոր անդամն է գալիս:


           Այդ երեք օրը Լոլայի համար հավերժություն թվաց: Նա ահավոր շատ էր ուզում հանդիպել փոքրիկ եղբորը: Չնայած այդ օրերի ընթացքում հասցրել էր հայրիկին օգնել, տները հավքել, փոքրիկ նախաճաշիկներ պատրաստել, բայց միևնույնն է, ժամանակը շատ դանդաղ էր անցնում: Վերջապես եկավ բաղձալի առավոտը, և Լոլան, հագնելով իր վարդագույն, ժապավեններով զարդարված զգեստը, վարսերին դնելով փայլփլուն թագը, հայրիկի ձեռքը բռնած, ուղևորվեց եղբորը դիմավորելու:

           Նրանց հանդիպումը շատ սրտաճմլիկ էր՝ գրկախառնություններ, պաչիկներ, խինդ, ծիծաղ, հուզմունք: Տանն էլ հավեսով նշեցին եղբոր գալուստը: Լոլան շատ ուրախ էր, որ եղբայր ունի ու այսուհետ միասին երկար կխաղան, երբ մայրիկն ու հայրիկը հոգնեն խաղից: Օրերը անասելի արագ էին գլորվում: Փոքրիկը Մայքը գնալով ակտիվանում էր, ուշադրությունը դեպի փոքր եղբայրը անասելի շատ էր, չնայած որ ծնողները խոսում էին Լոլայի սիրված և գնահատված լինելու մասին: Լոլայի սրտում մի փոքր տարակուսանք կար նա մայրիկից ու հայրիկից չէր տեսնում այդչափ ուշադրություն , քան նախկինում էր: Զբոսանքներն ու խաղերն էլ քչացել էին: Ինչպես ասում էր հայրիկը. « Լո՛լա, մայրիկը հոգնած է. ամբողջ օրը վազվզվում է Մայքի ետևից: Դու մեծ ես և պետք է հասկանաս դա: Շուտով Մայքը կմեծանա ու միասին խաղեր կխաղանք, ֆիլմեր կդիտենք և միասին զբոսանքի կգնանք, իսկ հիմա համբերատար եղիր, ըմբռնումով մոտեցի՛ր, սիրիր և գուրգուրիր եղբորդ»:


           Լոլայի ներսում ամեն ինչ տակնուվրա էր եղել, իրեն թվում էր՝ եղբայրը զբաղեցրել էր իր տեղը՝ մայրիկի և հայրիկի սրտում, և ինքր ավելորդ է այդ տանը: Օրերով եղբորը չէր մոտենում, անգամ մոր խնդրանքին, որ հետևի եղբորը, մերժում էր: Ողջ օրը իր սենյակում խաղալիքներով էր խաղում, աշխատում էր չառնչվեր եղբոր հետ: Մայքը՝ արեգակի պես լուսաշող տղա էր, բաց կապույտ աչքերով և գանգուր, խարտյաշ մազերով: Գրեթե միշտ ժպտում էր, երբ հանդիպում էր Լոլային, ձգվում դեպի նա և շոյում մազերը, իսկ Լոլան աշխատում էր շրջանցել Մայքին: Հետաքրքիր արկածները՝ Մայքի հետ կապված, ծիծաղն ու խինդը՝ Մայքի պատճառած, տանից չէր պակասում, բայց միևնույնն է Լոլան չէր ցանկանում շփվել եղբոր հետ: Մոր և հոր երկարատև զրույցներից հետո էլ նույն կերպ էր վարվում: Մի գիշեր Մայքը չքնեց. ողջ գիշեր լալիս էր, ճչում:

           Առավոտյան բժիշկ եկավ: Դրվեց ախտորոշումը՝ սուր շնչառական վարակ. նշանակվեցին դեղերը, մշակվեց բուժման պլանը: Մայքը էլ չէր ժպտում, հակառակը անընդհատ լալիս էր, քնում էր շատ քիչ, ջերմում էր օրվա մեծ մասը: Բայց երբ Լոլան միջանցքում հանդիպեց Մայքին, այդ լուսաշող տղան լացակումած աչիկներով նայեց Լոլային, փարվեց նրան և սկսեց ժպտալ: Բոլորը ապշած էին՝ ինչքան սեր կար փոքրիկի ներսում: Լոլայի սիրտն էլ ակամայից լցվեց. նա հասկացավ, որ սերը և գուրգուրանքը ավելի շատ հարկավոր է այդ փոքրիկին, քան իրեն: Նա իր փոքրիկ թաթիկներով ամուր գրկեց եղբորը, համբուրեց թուշիկները և տեղավորվել բազկաթոռի մեջ. սկսեց նրա հետ մուլտֆիլմ դիտել: Հետո թեթև թեքեց նրան իր փոքրիկ ուսին, մայրիկի պես օրորեց և շուտով Մայքը փակեց իր կապույտ աչուկները:

           Խորը քնեց: Երբ արթնացավ, էլ չէր ջերմում: Լոլան էլ առաջվա պես չէր թաքնվել իր սենյակում՝ եղբոր կողքին էր, անհամբեր սպասում էր, որ արթնանա՝ միասին շարունակեն մուլտֆիլմի դիտումը: Նա հասկացավ, որ այդ փոքրիկը շատ կարևոր անդամ է իրենց տանը և մայրիկի ու հայրիկի սերը կբավականացնի երկուսին էլ:
"""
            ,
            author: "Լավ հեքիաթներ",
            timeToRead: 20,
            ageGroup: .adult,
            tags: ["ԵՐԵԽԱ","ՄԻԱԿ","ՈՒՇԱԴՐՈՒԹՅՈՒՆ","ՍԵՐ"]
        ),
        Tale(
            title: "Թարսուշիտակ հեքիաթ գիշերային վախերի մասին",
            content: """
         Մի մեծ տանն ապրում էին փոքրիկ գիշերային հրեշները։ Նրանք այնքան վախկոտ էին, որ երբեք ցերեկը տանը չէին երևում։ Նրանք վախից դողում էին միայն այն մտքից, որ կարող է տան բնակիչներից որևէ մեկին հանկարծ հանդիպեն։

         Միայն երբ գալիս էր գիշերը, երբ տան բոլոր բնակիչները պառկում էին քնելու, գիշերային հրեշները զգուշորեն դուրս էին գալիս իրենց թաքստոցից ու հերթով մտնում տղաների ու աղջիկների սենյակները, որ նրանց խաղալիքներով խաղան։


         Նրանք փորձում էին շատ լուռ լինել ու ամբողջ ժամանակ ականջ էին դնում ձայներին։ Եթե սենյակում նույնիսկ շատ կամաց շշուկ էր լսվում, գիշերային հրեշներն անմիջապես ցած էին գցում խաղալիքները, ու պատրաստվում ցանկացած պահի փախչել։ Նրանց մազերը վախից բիզ-բիզ էին կանգնում, իսկ աչքերը վախից կլորանում ու մեծանում էին։

         Կարող եք պատկերացնել, թե ի՞նչ կպատահի այն երեխաների հետ, ովքեր հատակին ընկնող խաղալիքի ձայնից կարթնանան ու նման վախեցած հրեշների կտեսնեն։ Ցանկացած նորմալ երեխա կսկսի բղավել ու ծնողներին օգնության կանչել։

         Երեխաների ճիչը լսելուց գիշերային հրեշներն ավելի էին խառնվում իրար։ Պատահում էր, նրանք մոռանում էին, թե որտեղ է գտնվում սենյակի դուռը ու անկյունից անկյուն էին վազում, որ դուռը գտնեն։ Այդ ընթացքում կարող էին ցատկել նաև երեխայի մահճակալի վրա։

         Բայց, այնուամենայնիվ, հասցնում էին թաքնվել մինչև ծնողների գալը։

         Իսկ ծնողները մտնում էին սենյակ, վառում սենյակի լույսը, հանգստացնում երեխաներին ու բարի գիշեր մաղթելով վերադառնում իրենց ննջասենյակ։ Եվ ամբողջ տունը նորից խոր քուն էր մտնում։

         Ու միայն փոքրիկ գիշերային հրեշներն էին, որ մինչև առավոտ աչք չէին փակում։ Նրանք տխուր, հոնգուր-հոնգուր լաց էին լինում իրենց թաքստոցում, որովհետև էլի չէին կարողացել խաղալ խաղալիքներով։

         Սիրելի երեխաներ, ձեր բղավոցներով մի վախեցրեք գիշերային հրեշներին։ Թույլ տվեք, որ նրանք գիշերը մի քիչ խաղան ձեր խաղալիքներով։
"""
            ,
            author: "Լավ հեքիաթներ",
            timeToRead: 10,
            ageGroup: .elementary,
            tags: ["ԳԻՇԵՐԱՅԻՆ ՎԱԽԵՐ","ՀՐԵՇՆԵՐ"]
        ),
        Tale(
            title: "Մկնիկ-Անվախիկը. Վտանգավոր դիտահորը",
            content: """
       Մկնիկ-Անվախիկը ոչ միայն քաջ էր, այլ նաև շատ հետաքրքրասեր։ Մի անգամ փողոցով քայլելիս տեսավ մի մե՜ծ, կլոր որջ՝ բաց դիտահոր։

       -Ա՜յ քեզ մեծ որջ,- զարմացան մկնիկը։ – Տեսնես ո՞վ է ապրում այնտեղ։ Հսկայական խլո՞ւրդը։ Այ քեզ ո՜րջ…


       Մկնիկը նախկինում երբեք հսկա խլուրդ չէր տեսել։

       «Ի՜նչ լավ կլիներ, եթե նրա հետ ծանոթանայի»,- մտածեց նա։- «Բայց ավելի լավ կլիներ ընկերանալ նրա հետ»։

       Իրենք միասին կզբոսնեն՝ փոքրիկ մկնիկն ու հսկա խլուրդը,- ու ոչ ոք-ոչ ոք իրենց չի նեղացնի։ Ո՞վ կհամարձակվի բան ասել հսկա խլուրդին։ Նա թաթի մի հարվածով մի ակնթարթում հողում կթաղի նեղացնողին։


       «Պետք է նրա հետ ծանոթանալ»,- որոշեց մկնիկն ու մտավ դիտահորի մեջ։ Իսկ այն մե՜ծ էր ու խորը։ Սա հո հասարակ խլուրդի ո՞րջ չի։

       -Մամա՜… Փրկե՜ք… – բղավեց մկնիկը՝ ընկնելով հորի հատակը։

       Իսկ այնտեղ, իհարկե. ոչ մի խլուրդ չկար։ Միայն խողովակներ էին, որոնցով տներից դուրս էին հոսում կեղտաջրերը։


       «Ահա թե ում համար են փորել այս հսկայական որջը», – գլխի ընկավ մկնիկը։ – «Թե ինչի՞ մտա այստեղ։ Ի՞նչ եմ անելու հիմա»։

       Լավ էր, այդ պահին արագիլն էր թռչում մոտակայքում։ Նա լսեց մկնիկի բղավոցը և հանեց նրան դիտահորից։ Իսկ եթե արագիլն այդ կողմերով չթռչեր, մեր Անվախիկը մի ամբողջ դար մնալու էր այդ դիտահորում։

       Փոխարենը մկնիկն ականջին օղ արեց. չի կարելի մտնել դիտահորի մեջ։ Չի կարելի նույնիսկ կանգնել դիտահորի կափարիչի վրա։ Այն կարող է բացվել և դու կընկնես հորը։
"""
            ,
            author: "Լավ հեքիաթներ",
            timeToRead: 5,
            ageGroup: .preschool,
            tags: ["ԱՆՎՏԱՆԳՈՒԹՅԱՆ ԿԱՆՈՆՆԵՐԸ","ՄԿՆԻԿ-ԱՆՎԱԽԻԿ","ԶԳՈՒՇՈՒԹՅԱՆ ԿԱՆՈՆՆԵՐ"]
        ),
        Tale(
            title: "Կապիկը, որ չէր ուզում մանկապարտեզ գնալ",
            content: """
      Կար-չկար մի կապիկ կար։ Երբ նա դեռ փոքրիկ էր, մայրիկի հետ տանն էր մնում։ Հետո նա մեծացավ, և մայրիկը ասաց նրան։

      – Դու արդեն մեծ ես և պետք է գնաս մանկապարտեզ, փոքրիկ կապիկ։

      Կապիկը դեռ չգիտեր, թե ինչ է մանկապարտեզը, և այդ պատճառով գոռաց։

      – Ես վախենո՜ւմ եմ մանկապարտեզից։ Չե՛մ ուզում։

      – Մանկապարտեզը, – փորձեզ բացատրել մայրիկը,- մի տեղ է, որտեղ կան շատ երեխաներ։ Նրանք իրար հետ խաղում և ուրախանում են։

      – Ինչի համար են ինձ պետք երեխաները,- ասաց կապիկը։- Ես ունեմ տիկնիկներ՝ Մուսյան, Տուսյան և Տատուսյան։ Ես նրանց հետ կխաղամ։

      Կապիկը հանգիստ խաղում էր իր տիկնիկների հետ, բայց մի օր նա սկսեց լացել։

      – Ինչո՞ւ ես լացում,- հարցրեց մայրիկը,- միգուցե քո տիկնիկները լա՞վը չեն։

      – Նրանք ինձ չեն լսում,- ասաց կապիկը։- Մուսյան չի ուզում ինձ հետ պարանով ցատկել։ Տուսյան չի խոսում ինձ հետ։ Իսկ Տատուսյան չի երգում։

      – Նրանք չեն կարող, նրանք երեխաներ չեն,- բացատրեց մայրիկը,- չապրող, չշնչող տիկնիկներ են։ Ի՞նչ ես դու նրանցից ուզում։

      – Ուզում եմ երեխաների մոտ գնալ։ Ապրող-շնչող։ Ուրախ։ Որպեսզի իրար հետ պարան ցատկենք ու երգեր երգենք։

      Հաջորդ օրը մայրիկը կապիկին տարավ մանկապարտեզ։ Փոքրիկը տեսավ, թե ինչ ուրախ ու լավ է մանկապարտեզում, և նա արդեն չէր վախենում։
"""
            ,
            author: "Լավ հեքիաթներ",
            timeToRead: 5,
            ageGroup: .elementary,
            tags: ["ՄԱՆԿԱՊԱՐՏԵԶ"]
        ),
        Tale(
            title: "Արջուկը, որը վախենում էր մենակ քնել",
            content: """
      Կար-չկար մի արջուկ կար։ Մայրիկի և հայրիկի հետ նրանք ցերեկները անտառում զբոսնում էին ու հատապտուղներ հավաքում։ Իսկ գիշերը մայր արջը Արջուկին ասում էր.

      – Քնելու ժամն է, որդիս։ Պառկիր մահճակալին, ծածկոցով ծածկվիր ու քնիր։
      – Չե՛մ ուզում մենակով քնել,- փնթփնթաց Արջուկը։- Ուզում եմ մայրիկի ու հայրիկի հետ…
      – Բա ի՞նչ անենք,- մտածեց մայրիկը։ – Հայրիկի հետ քնել չի կարլեի։ Գիտես, նա բարկանում է. «Ո՞վ է պառկել իմ մահճակալին և տրորել այն»։ Ես էլ եմ բարկանում։
      – Ես չեմ բարկանում,- ասաց Արջուկը։- Դուք եկեք իմ մոտ։
      – Շատ լավ,- համաձայնեց մայրիկը։ – Ես ու հայրիկը կգանք քո մոտ։ Իսկ հետո ի՞նչ կլինի։ Մենք քո մահճակալը կկոտրենք, ինչպես հեքիաթում։ Գիտե՞ս ինչ։ Ես քեզ փոքրիկ փափուկ խաղալիք արջուկ կտամ։ Դու նրան կկերակրես, կխաղաս նրա հետ։ Հետո նրան կպառկեցնես քնելու։ Գիտե՞ս, նա իրեն շատ լավ կզգա քո անկողնում։ Դու էլ մենակ չես լինի։
      – Իհարկե՜,- ուրախացավ Արջուկը։

      Այդ օրվանից նա ամեն օր իր խաղալիք արջուկին քնեցնում էր իր հետ։ Նրա համար հեքիաթներ էր պատմում, երգեր երգում, ծածկոցով ծածկում։ Խաղալիք արջուկը անուշ քնում էր։ Քնում էր նրա հետ նաև Արջուկը։ Ու նա այլևս չէր վախենում, չէ՞ որ նա այլևս մենակ չէր քնում։
"""
            ,
            author: "Լավ հեքիաթներ",
            timeToRead: 5,
            ageGroup: .preschool,
            tags: ["ԱՐՋՈՒԿ", "ՔՈՒՆ"]
        ),
        Tale(
            title: "Հեքիաթ անվախ սնկի մասին",
            content: """
      Սա մի պատմություն է մի վայրի մասին, որտեղ ոչ ոք երբեք չի եղել․ եղել են միայն սնկեր և դոդոշներ։ Այն գտնվում էր անտառի խորքում ։ Սնկերը, որոնք բնակվում էին այդտեղ, օժտված էին մոգությամբ. կարողանում էին նոր սնկեր աճեցնել, ստեղծագործել, իրեր նորոգել․․․

      Օժտված լինելով այդ մոգությամբ՝ հպարտ էին և սիրում էին իրենց հողը, տարածքը։ Ունեին փոքրիկ պոչեր, որոնցով հպարտանում էին և երկար ժամանակ տրամադրում նրանց խնամքին՝ օգտագործելով տարբեր խնամքի պարագաներ։ Մի ընտանիք էր այնտեղ բնակվում ։


      Մայրը, որի անունը Մուլլի էր և հայրը։ Նրանք սպասում էին փոքրիկի։ Մի ցուրտ օր Մուլլին իր հերթական մոգության ժամանակ կայծակնահար է լինում, վնասելով պոչը, հարված է ստանում և մահանում է։ Ծնվում է նրա բալիկը, բայց մայրը մահանում է։

      Փոքրիկը ծնվում է, սակայն առանց պոչիկի ․․․ Բոլորը սարսափում են և չեն մոտենում երեխային, քանզի նա տարբերվում էր իրենցից․ նա անպոչ էր ։
      Անցան տարիներ, և Փուլլովին մեծացավ, խնդիրը սրվեց․․․ Նրան ծաղրում էին թե տանը, թե դպրոցում, թե շրջապատում։ Փուլլովին չէր հասկանում, թե ինչ է արել, որ արժանացել է ծաղրանքի։ Մի՞թե մի պոչիկի բացակայությունը կարող էր այդպիսի հետևանք թողնել։ Նա գերազանց էր թե դպրոցում, թե մոգության մեջ։ Երազանքն էր ունենալ սեփական հող և աճեցնել բազմաթիվ սնկեր։


      Փուլլովին շատ էր աշխատում՝ մինչև ուշ երեկո։ Գնալով բոլորը զարմանում էին աղջկա կարողությամբ , սակայն նրա հետ ընկերանալ չէին փորձում, որովհետև նա տարբեր էր իրենցից։ Միայն Փուլլովիի ուսուցիչն էր, որ նրան խրախուսում էր, ոգևորում, սովորեցնում: Մի չարաբաստիկ օր Փուլլովին իր սովորության համաձայն շրջում էր անտառում, երբ սկսեց ուժեղ անձրև տեղալ, կայծակն էլ չուշացավ։ Հանկարծ հեռվից լսվեցին աղիողորմ ճիչեր․ խեղճ փոքրիկ սունկիկը ընկել էր փոսը։ Չնայած Փուլլովին սարսափում էր կայծակից, բայց վազեց ձայնի կողմը, գրկեց փոքրիկին ու շտապեց դուրս գալ անտառից։ Սակայն կայծակից հարված ստացավ։ Փուլլովին հրաշքով փրկվեց, փրկվեց նաև փոքրիկը։ Բոլորը հիացած էին աղջկա ուժով, բարությամբ, հոգատարությամբ, անվախությամբ և նրանից ներողություն խնդրեցին։

      Մարդիկ, երբեք չդատեք դիմացինին արտաքինով։
"""
            ,
            author: "Լավ հեքիաթներ",
            timeToRead: 10,
            ageGroup: .teenager,
            tags: ["ՀԵՔԻԱԹ"]
        ),
        Tale(
            title: "Կարմիր Գլխարկը",
            content: """
     Լինում է, չի լինում մի փոքրիկ աղջիկ։ Մայրիկն ու տատիկը նրան անչափ շատ էին սիրում Թոռնիկի ծննդյան օրվա կապակցությամբ տատիկը նրան կար­միր գույնի մի գլխարկ էր նվիրել, որր շատ էր դուր եկել աղջնակին։ Անվերջ նրա գլխին էր կարմիր գլխարկը, ասում են նույնիսկ գիշերները չէր հանում գլխիցկ։ Այդ պատճառով բոլոր ծանոթներն ու հարևանները նրան անվանում էին Կարմիր Գլխարկ։

     Մի անգամ Կարմիր Գլխարկի մայրիկը կարկանդակ է թխում. Մի քանի կարկանդակ տեղավորելով զամբյուղի մեջ՝ ասում է աղջկան.

     – Կարմիր Գլխարկ, տար այս զամբյուղը տատիկին։ Նա վատառողջ է։ Զգույշ կլինես, չմոլորվես անտառում։ Անպայման կհարցնես, թե ինչպես է տատիկի առողջությունը։ Եվ ամենակարևորը՝ չուշանաս, երեկոյան տանը կլինես։

     Կարմիր Գլխարկը վերցնում է զամբյուղը և անմիջապես ճանապարհ ընկնում։

     Տատիկն ապրում էր անտառի մյուս կողմում՝ առանձնացված մի տնակում։

     Անտառում ապրում էր գորշ գայլը։ Դեպի տատիկի տուն տանող ամենաապահով ճանապարհն անցնում էր անտառի եզրով, որով հենց շարժվում էր Կարմիր Գլխարկը։

     Գայլը դուրս է թռչում ծառի հետևից և կտրում աղջկա առջևը.

     – Այս ու՞ր ես գնում, Կարմիր Գլխարկ, – հարցնում է գայլը։

     – Տատիկիս մոտ, – վախեցած պատասխանում է աղջիկը։

     – Իսկ հեռու՞ է ապրում տատիկդ։

     – Անտառի մյուս ծայրում։

     – Իսկ այդ ի՞նչ ես տանում։

     – Կարկանդակ։ Տատիկը հիվանդ է, գնում եմ նրան տեսակ­ցության։

     Իսկ խորամանկ գայլը, ցույց տալով դեպի անտառի խորքը գնացող ճանապարհն, ասում է.

     – Լավ, Կարմիր Գլխարկ։ Իսկ ինչո՞ւ ես այս երկար ճանապարհով գնում։ Ահա այս արահետով ավելի շուտ կհասնես տատիկի տուն։ Բացի դա, այս ճանապարհին գեղեցիկ ծաղիկներ են աճում։

     Գայլը խաբեց Կարմիր Գլխարկին, որ ինքը շուտ հասնի տատիկի տուն։ Շատ խորամանկ էր գայլը։ Նա որոշել էր ուտել և՛ Կարմիր Գլխարկին, և՛ տատիկին։

     Մինչ Կարմիր Գլխարկը երկար ճանապարհով կգնար դեպի տատիկի տուն, գայլն արդեն հասել էր այնտեղ.

     Գայլը մոտենում է դռանը և թակում.

     – Թը՛խկ-թը՛խկ;

     – Ո՞վ է. – հարցնում է տատիկը ներսից։

     – Ես եմ, տատիկ, Կարմիր Գլխարկը, – ձայնը փոխելով պատասխանում է գայլը. – քեզ կարկանդակներ եմ բերել, որպեսզի ուտես և շուտ առողջանաս։

     – Պարանը քաշիր, դուռը կբացվի, թոռնիկս։

     Գայլը պարանը քաշում է և բաց է անում դուռը։ Գայլը վրա է հասնում և ողջ-ողջ կուլ է տալիս տատիկին։

     «Ահա, – մտածում է անկուշտ կենդանին. – վերջապես այսօր փառահեղ կսնվեմ»։ Նա հագնում է տատիկի շորերը մտնում անկողին և սպասում Կարմիր Գլխարկին։

     Շուտով հայտնվում է Կարմիր Գլխարկը։

     – Թը՛խկ-թը՛խկ, –  թակում է նա դուռը։

     – Ո՞վ է. – հարցնում է գայլը խռպոտ ձայնով։

     Կարմիր Գլխարկը քիչ է մնում սարսափահաը լինի գայլի հաստ ձայնից, բայց մտածում է. գուցե մրսելուց է տատիկի ձայնը կոշտացել։ Ուստի հանգստացնում իրեն ու պատասխանում.

     – Ես եմ, Կարմիր Գլխարկը, տատի՛կ, քեզ կարկանդակներ եմ բերել, որպեսզի ուտես և առողջանաս։

     – Պարանը քաշիր, դուռը կբացվի, թոռնիկս։

     Կարմիր Գլխարկը պարանը քաշում է, դուռը բացվում է։

     Երբ Կարմիր Գ|խարկր ներս է մտնում, գայլը ծածկվում է վերմակի տակ ու ասում.

     – Կարկանդակները դիր սեղանին ու եկ ինձ մոտ։ Տեսնեմ՝ դո՞ւ ինչպես ես։

     Կարմիր Գլխարկն անում է այնպես, ինչպես կարգադրում է տատիկը, և մոտենում է

     նրան։ Տեսնում է տատիկի երկար ձեռքերն ու ասում.

     – Տատիկ, – հարցնում է Կարմիր Գյխարկը, – իսկ քո ձեռքերն ինչո՞ւ են այդքան մեծ։

     Գայլը պատասխանում է.

     – Որպեսզի քեզ ամո՜ւր գրկեմ,թոռնիկս։ 

     Նայում է նրան Կարմիր Գլխարկը և նորից հարցնում.

     – Տատի՛կ, իսկ քո ականջներն ինչո՞ւ են այդքան մեծ։

     – Որպեսզի քեզ լա՜վ լսեմ, թոռնիկս։

     – Տատի՛կ, իսկ քո աչքերն ինչո՞ւ են այդքան մեծ։

     – Որպեսզի քեզ լա՜վ տեսնեմ, թոռնիկս։

     – Տատիկ, իսկ քո բերանն ինչո՞ւ է այդքան մեծ։

     – Որպեսզի քեզ արագորեն խժռեմ, թոռնիկս…

     Կարմիր Գլխարկը սարսափահար փորձում է փախչել, սակայն գայլը նետվում է նրա ետևից և կուլ է տալիս փոքրիկ աղջկան։

     Այդ պահին տատիկի տան մոտով փայտահատն էր անցնում։ Նա լսում է տատիկի տան աղմուկը և հասկանում, թե ինչ է պատահել։

     Առանց երկար-բարակ մտածելու փայտահատը մոտենում է տատիկի տանը և նկատում, որ դուռը կիսաբաց է։ Նա մտնում է ներս ու անմիջապես կացնով պատռում գայլի տռզած փորը

     Եվ հանկարծ գայլի պատռված փորից դուրս են գալիս Կարմիր Գլխարկն ու տատիկը։ Երկուսն էլ՝ ողջ ու անվնաս։ Գայլը նրանց ողջ-ողջ կուլ էր տվել, և նրանք գերի էին ընկել գայլի ստամոքսում։
     Գայլն այլևս ոչ ոքի չէր անհանգստացնում ու արդեն բոլորը կարող էին հանգիստ մտնել անտառ։
     Իսկ Կարմիր Գլխարկն արդեն առանց վախենալու շուտ-շուտ այցելում էր տատիկին։
"""
            ,
            author: "Չարլզ Պերրո",
            timeToRead: 35,
            ageGroup: .preschool,
            tags: ["ԳԱՅԼ", "ՏԱՏԻԿ", "ԱՂՋԻԿ"]
        ),
        Tale(
            title: "Բարև – ցտեսություն",
            content: """
     Ապրում էր երկրի վրա մի փոքրիկ մեղու։ Փոքրիկ էր նա, բայց շատ ուրախ։ Մի անգամ առավոտյան նա մարգագետին եկավ ու տեսավ, որ ոչ ոք չի ուրախանում։ Արեգակը չի շողում, թռչունները չեն երգում, ծաղիկները չեն ծաղկում։
     Թռավ մեղվիկը մայրիկի մոտ ու պատմեց, թե ինչ է կատարվում մարգագետնում։
     – Իսկ գուցե նրանք պարզապես քնա՞ծ են,- հարցրեց մայրիկը։ – Յուրաքանչյուրին ողջունիր ու ժպտա։
     – Ինչպե՞ս,- հարցրեց մեղվիկը։ – Ես չգիտեմ։
     – Պետք է ասել. «Բարև Ձեզ կամ ողջույն»։
     Վերադարձավ մեղվիկը տխուր մարգագետին, ժպտաց ու քնքուշ ասեց.
     – Ողջո՜ւյն, արեգակ։ Ողջո՜ւն, թռչնակ։ Բարև ձեզ, ծաղիկներ։
     Ու արեգակը միանգամից շողշողաց, ուրախացավ ու սկսեց տաքացնել մեղվիկին իր ջերմ շողերով։ Թռչնակը մեղվիկի համար երգեր երգեց, իսկ ծաղիկները բացեցին իրենց թրեթիկները, որպեսզի մեղվիկը քաղցր նեկտար հավաքի։
     Ամբողջ օրը մեղվիկն ուրախացավ մարգագետնում։ Բայց եկավ տուն վերադառնալու ժամը։
     – Իսկ եթե հանկարծ վաղը ջերմ արևը չլինի՞, թռչնակը չերգի, ծաղիկներն իրենց թերթիկները չբացե՞ն…
     – Կլինեն,- հանգստացրեց նրան մայրիկ մեղուն,- պարզապես պետք է ճիշտ հրաժեշտ տալ։ Պետք է ասել. «Ցտեսությո՛ւն» ու թաթիկը շարժել։ Դա կնշանակի, որ վաղը դուք նորից կհանդիպեք։
     – Ցտեսությո՜ւն, արեգակ, թռչնակ ու ծաղիկներ, – ասաց փոքրիկ մեղվիկը։
     – Ցտեսությո՜ւն, մեղվիկ,- պատասխանեց արեգակն ու շողերը թափահարեց։
     – Ցտեսությո՜ւն,- երգեց թռչնակն ու թևերը թափահարեց։
     – Ցտեսությո՜ւն,- հրաժեշտ տվեցին ծաղիկներն ու թերթիկները թափահարեցին։
"""
            ,
            author: "Լավ հեքիաթներ",
            timeToRead: 10,
            ageGroup: .preschool,
            tags: ["ԷԹԻԿԵՏ","ՀԵՔԻԱԹ"]
        ),
        Tale(
            title: "Անհնազանդ փղիկը",
            content: """
     Ինչպես գիտեք, աշխարհի ամենամեծ կենդանիները՝ փղերը, ապրում են Աֆրիկայում։ Նրանք ոչ միայն հայտնի են իրենց մեծությամբ, այլև սավաննայում ամենաբարեկիրթ ու հնազանդ զավակներն են։ Փղիկները, որպեսզի չկորչեն և մայրիկին ու հայրիկին չանհանգստացնեն, զբոսանքի ժամանակ իրենց փոքրիկ կնճիթով միշտ բռնում են մայրիկի պոչից։

     Բայց այսօր մենք կպատմենք մի անհնազանդ փղիկի մասին։

     Մի անգամ փղերը ողջ ընտանիքով դուրս եկան զբոսանքի։

     – Հանկարծ հեռու չգնաս,- փղիկին ասաց մայրիկը։ Նա գիտեր իր զավակի անհնազանդ բնավորության մասին ու շատ անհանգիստ էր այդ պատճառով։ – Դու դեռ շատ փոքր ես, կմոլորվես։

     – Լավ,- համաձայնեց փղիկն ու սկսեց վայելել բանանները, որոնք հայր փիղն իր երկար կնճիթով քաղում էր։

     Հանկարծ ասես մի փոքրիկ ծիածան հայտնվեց նրա առաջ։ Փղիկը բարձրացրեց գլուխը։ Այդ ճպուռի թևերն էին ծիածանի նման շողշողում արևի ճառագայթների տակ։ Մոռանալով ամեն ինչի մասին, չլսելով ծնողների անհանգիստ կանչերը` փղիկը վազեց ճպուռի հետևից։ Նա շատ էր ուզում բռնել այդ «արևային նապաստակին»։ Իսկ ճպուռը թռչկոտելով անհետացավ բարձր խոտերի մեջ։ Փղիկը ստիպված կանգ առավ։

     «Ինչո՞ւ ես երբեք չեմ լսում մայրիկին,- մտածեց նա` մացառուտների մեջ առաջ գնալով։ – Ինչպե՞ս հիմա գտնեմ այն արահետը, որով վազում էի։ Ինչպե՞ս վերադառնամ հայրիկի ու մայրիկի մոտ։»

     Փղիկն արդեն պատրաստվում էր լաց լինել, երբ թփերի հետևից աղիողորմ ճիչ լսեց։ Մոռանալով իր դժբախտության մասին` վազեց դեպի թփերը՝ իմանալու, թե ի՞նչ է պատահել։ Ու ծառի տակ տեսավ փոքրիկ թութակին։

     – Ի՞նչ է պատահել,- հարցրեց փղիկը։

     – Մայրիկն ինձ թույլ չի տալիս թռչել, բայց երբ նա տանը չէր, ես փորձեցի…

     – Ու չլսեցիր մայրիկին,- փղիկն իր կնճիթի օգնությամբ զգուշորեն բարձրացրեց փոքրիկ թութակին ու տեղավորեց բնի մեջ։

     – Շնորհակալ եմ, – ասաց թութակը։

     – Ես եմ քեզ շնորհակալ,- պատասխանեց փղիկը։

     Փղիկը թփերի արանքում արահետ տեսավ։ Արահետով նա առաջ վազեց` հույս ունենալով, որ ի վերջո կգտնի հայրիկին ու մայրիկին։ Արահետը ձգվում էր թփերի ու ծառերի միջով։ Թվում էր, թե ուր որ է` կհասնի ծնողներին, բայց դրա փոխարեն փղիկը հասավ մարգագետնին։

     Փղիկն էլ չդիմացավ ու սկսեց լաց լինել։ Նա քայլում էր` չիմանալով թե ուր, ինքն իրեն կշտամբելով, որ չի լսել մայրիկին։ Հանկարծ ինչ-որ մեկի լացի ձայնը լսեց։

     «Մի՞թե, բացի թութակից, ինձ նման ուրիշ մեկն էլի չի լսել ծնողներին»,- մտածեց փղիկը։

     Մի քիչ առաջ գնալով` հանդիպեց կորյունին։

     – Ինչո՞ւ ես լաց լինում,- հարցրեց փղիկը։ – Մոլորվե՞լ ես։

     – Չէ, չեմ մոլորվել,- արցունքների միջից պատասխանեց կորյունը։ – Ծնողներս ինձ թույլ չեն տալիս վազել մացառախոզերի հետևից։ Իսկ ես նրանց չլսեցի ու վազեցի։  Մացառախոզն իր երկար ու սուր փշերով ծակեց իմ երկու թաթերը, ու հիմա ես չեմ կարող վերադառնալ տուն։

     Փղիկն անմիջապես մոռացավ իր դժբախտության մասին։

     – Մի՛ լացիր, ես քեզ կօգնեմ։

     Նա ծնկի իջավ, կորյունը բարձրացավ նրա մեջքին։ Փղիկը նորից կանգնեց։

     – Հրաշալի է, – ուրախացավ կորյունը։ – Վերևից լավ է երևում ճանապարհը։

     Նրանք արագ հասան առյուծների տուն, և կորյունը պառկեց հանգստանալու։

     – Շատ շնորհակալություն, փղի՛կ, դու ինձ շա՜տ օգնեցիր։

     – Խնդրե՜մ,- տխուր պատասխանեց փղիկը։ – Կարևորը` արդեն տանն ես։ Ո՜նց կուզեի ես էլ տանը լինել… Վա՜յ, արահետ…

     Եվ իրոք, ճյուղերի մեջ արահետ երևաց։ Այս անգամ այն լավ տրորված ճանապարհ էր։ Այն չէր ոլորվում, այլ ձգվում էր ուղիղ-ուղիղ ու կարծես փղիկին ասում. «Մի վախեցիր, ես քեզ կտանեմ քո ծնողների մոտ»։

     Փղիկն այնպես ոգևորված առաջ նետվեց, որ հազիվ հասցրեց կանգ առնել առջևում բացված լճակի մոտ։ Լճակի մեջ հուսահատ շարժվում էր փոքրիկ ռնգեղջյուրը՝ փորձելով ափ դուրս գալ։ Նրան հետևից գետաձիուկն էր հրում, բայց նրանց ոչինչ չէր հաջողվում. ափը շատ լպրծուն էր։

     Առանց մտածելու փղիկն իր կնճիթով բռնեց ռնգեղջյուրի եղջյուրից ու ամբողջ ուժով հետ գնաց։ Գետաձին շարունակում էր հետևից հրել։ Վերջապես հաջողվեց ռնգեղջյուրին ափ հանել։

     Շունչը տեղը բերելով` փղիկը հարցրեց փոքրիկ ռնգեղջյուրին.

     – Ինչո՞ւ էիր մտել լճակը, եթե լողալ չգիտես։ Կարող էիր խեղդվել…

     – Մայրիկս թույլ չի տալիս առանց իրեն լճի մոտ գամ, բայց մենք գետաձիու հետ վիճեցինք, թե մեզնից ով է ավելի արագ վազում։ Վազեցինք այն արահետով, որով գետաձիերն ու ռնգեղջյուրները գնում են լողալու։ Ես չհասցրեցի ժամանակին կանգ առնել ու ընկա ջուրը։ Լավ է, որ գետաձիուկը լողալ գիտեր։ Բայց եթե դու չգայիր լողալու…

     – Ես լողալ չեմ ուզում,- տխուր պատասխանեց փղիկը։ – Ես մոլորվել եմ։ Չլսեցի ծնողներիս, վազեցի ճպուռի հետևից ու հիմա չգիտեմ` որտեղ փնտրեմ նրանց։

     – Տեսնո՞ւմ ես, լճի կողքով արահետ է գնում,- ասաց գետաձիուկը։ – Այն բարձրանում է դեպի բլուր։ Քիչ առաջ այն կողմից փղերի ձայներ էին լսվում։ Ինձ թվում է` քեզ էին կանչում։

     – Իրո՞ք։ Շնորհակա՜լ եմ, գետաձիուկ։ Ցտեսությո՜ւն,- ու փղիկը նետվեց դեպի արահետը։ Բարձարանալով բլուրի վրա` նա տեսավ ծնողներին։

     – Մայրիկ, հայրիկ, վերջապես գտա ձեզ։ Հիմա ես միշտ կլսեմ ձեզ։

     – Իսկ ինչպե՞ս գտար մեզ,- հարցրեց հայրիկը։

     – Ես ամբողջ ժամանակ օգնում էի նրանց, ովքեր ևս հայտնվել էին դժբախտության մեջ՝ իրենց անհնազանդության պատճառով։ Եվ ամեն անգամ իմ առաջ արահետ էր բացվում։ Այն ինձ հեռացնում էր, բայց նաև բերում ձեզ մոտ։ Բայց քանի դեռ ձեզ էի փնտրում, սովորեցի օգնել ուրիշներին։ Իսկ նրանք օգնեցին ինձ ձեզ գտնել։
"""
            ,
            author: "Լավ հեքիաթներ",
            timeToRead: 25,
            ageGroup: .elementary,
            tags: ["ԱՆՀՆԱԶԱՆԴ","ԿԱՄԱԿՈՐ","ՀԵՔԻԱԹ","ՄԱՅՐԻԿԻՆ ՉԼՍՈՂ","ՈՒՍՈՒՑՈՂԱԿԱՆ","ՓՂԻԿ","ՓՈՔՐԻԿ"]
        ),
        Tale(
            title: "Անհնազանդ փղիկը",
            content: """
   Ձմեռ պապիկը հիվանդացել էր։ Տոներին շատ քիչ ժամանակ էր մնացել, բայց նա տկար էր ու հոգնած։ Ոտքի վրա չէր կարողանում կանգնել։ Տկարությունը մի կողմից, մտածմունքն էլ իր հերթին էր անհանգստանցում. ախր այդքան երեխա անհամբեր սպասում էին նվերների։ Իսկ եթե չհասցնե՞ր ժամանակին լավանալ, որպեսզի կարողանար բարձրացնել ու գետնին հարվածել ծանր կախարդական գավազանը, որպեսզի նվերներով լի պարկը հայտնվեր. այդ ժամանակ ամեն ինչ շատ տխուր ավարտ կունենար։ Երեխաները կդադարեին հավատալ հրաշքներին։ Ոչ գիշերը, ոչ ցերեկը քուն չէր գալիս աչքերին։ Ի՞նչ պիտի աներ։

   Նման մի անհանգիստ գիշեր նկուղի բնակիչ փոքրիկ մկնիկները լսեցին, թե ինչպես է Ձմեռ պապը հառաչում ու տխուր բարձրաձայն մտորում. «Հրաշքը փրկել է պետք. . .»
   Մկնիկները շատ փոքրիկ էին և Ձմեռ պապը նրանց չէր նկատել։ Մկնիկներին շատ տխրեցրին Ձմեռ պապի խոսքերը։ Եվ նրանք որոշեցին օգնել Ձմեռ Պապին։
   Հիմա եկավ նրանց մտածմունքների ժամանակը։ Իրենք շատ փոքր էին ու ոչ մի կերպ չէին կարող հենց իրենք օգնել Ձմեռ պապին։ Ինչքան էլ աշխատասեր լինեին, ինչքան էլ իրենց բոլոր բարեկամ-ազգականներին հավաքեին, միևնույնն է, միլիոնավոր երեխաների համար խաղալիքներ պատրաստել չէին կարող։
   Ձմեռ պապի կախարդական գավազանն էլ միայն Ձմեռ պապին էր ենթարկվում։ Ու նրանք չէին կարող այդ բարի պապիկի ծանր գավազանը հարվածել գետնին։ Ի՞նչ անել. . .


   Ամբողջ գիշեր ծվծվալով մկնիկները վազվզեցին նկուղում։ Ամեն մեկը մի բան էր առաջարկում, բայց ոչ մի առաջարկը խելքին մոտ չէր։ Ժամանակը արագ հոսում էր, իսկ լուծում դեռ չէր գտնվել։ Մկնիկներից միայն մեկը՝ Պստիկը, չէր մասնակցում ընդհանուր քննարկումներին։ Նա իր համար մի տաքուկ անկյուն էր գտել ու քուն մտել։ Երբ լույսը բացվեց, Պստիկը հորանջելով բացեց աչքերը ու զարմացավ, որ մնացած մկնիկները ամբողջ գիշեր չեն քնել։ Երբ իմացավ, թե ինչում է խնդիրը, սուսուփուս վազեց դուրս ու հետ վերադարձավ մի քանի ժամ անց։ Մյուս մկները ուշադրություն չդարձրեցին էլ նրա վրա ու չնկատեցին նրա վերադարձը։ Ու չտեսան, որ Պստիկը միայնակ չէր։ Նրա հետ մի տարօրինակ փոքրիկ մարդուկ կար։ Այդ մարդուկը հագել էր կանաչ ու կարմիր զոլավոր զգեստ, գլխին էլ նույն գույնից սուր պոպոզով գլխարկ ուներ։ Ու տարօրինակ ականջներ ուներ այդ մարդուկը, որ գլխարկի տակից փոքրիկ պոզիկների նման դուրս էին ցցված։ Փոքրիկ մարդուկը, որ զարմացած նայում էր մկնիկների անհանգիստ շարժումներին, պատահաբար դիպավ անկյունում դրված զանգին, որն էլ զիլ զրնգաց։


   Լավ է, Ձմեռ պապը գիշերվա անքնությունից հետո խորը քուն էր մտել ու չլսեց այդ ձայնը։ Բայց մկնիկները զանգի ձայնից անակնկալի եկած զարմացած նայեցին փոքրիկ մարդուկին։ Մարդուկը շփոթված նայեց շուրջն ու սուր ականջները շարժեց։ Պստիկը առաջ եկավ.
   – Ես գտել եմ խնդրի լուծումը։ Մեզ կօգնեն իմ ընկերները՝ էլֆերը։ Նրանք գետնի տակի կախարդական թագավորությունում են ապրում ու մարդկանց հետ չեն շփվում։ Ու նրանք էլ կախարդական ուժ ունեն, կարող են շատ արագ բոլոր նվերները պատրաստել։
   – Մնում է Ձմեռ պապիկին համոզել, որ ընդունի էլֆերի օգնությունը,- ուրախացած արձագանքեց մկնիկներից մեկը,- ախր բոլորս էլ գիտենք, որ Ձմեռ պապը շատ հպարտ է։
   – Դրա համար հետս բերել եմ Աստղ Էլֆին։ Նա կօգնի համոզել Ձմեռ պապիկին։

   Աստղ էլֆը մկների հետ բարձրացավ Ձմեռ պապի սենյակը։ Պապը քնած էր, իսկ բուխարու մեջ ուրախ-ուրախ ճտճտում էին վառվող փայտերը։ Ձմեռ պապը տարօրինակ շարժում զգալով, բացեց հոգնած աչքերը։ «Չէ, այս քունն էլ չապաքինեց ինձ»,- մտածեց Ձմեռ պապը ու տխուր հառաչեց։ Հետո նայեց բուխարու կողմը ու նկատեց փոքրիկ մարդուկին։ Մկները վախից թաքնվեցին բուխարու հետևը։ Զարմացած պապը տրորեց աչքերը։ Չէ, սա երազ չէր, ոչ էլ զառացանք։ Բուխարու կողքը իրոք փոքրիկ մարդուկ էր կանգնած։

   – Ո՞վ ես դու։
   – Աստղն եմ ես։ Ես էլֆ եմ. . .- կմկմաց էլֆն ու կամաց-կամաց համարձակություն ձեռք բերելով ավելի հաստատուն ձայնով շարունակեց. – Իմ ընկեր Պստոն է ինձ կանչել այստեղ։
   – Պստոն ո՞վ է։
   – Մուկիկ է, փոքր, շատ փոքր։
   – Բայց նաև շատ համարձակ,- բուխարու հետևից լսվեց Պստոյի ձայնն ու իրար հետևից կամաց-կամաց դուրս եկան մկնիկները։
   – Ներիր, Ձմեռ պապ։ Մենք պատահաբար իմացանք, որ դու հիվանդ ես ու օգնության կարիք ունես,- ծվծվացին մկները։ – Պստոն էլ Նոր տարին փրկելու հնարը գտավ։
   – Էլֆերը իմ ընկերներն են։ Նրանք շատ աշխատասեր են… ես մտածեցի, որ նրանք կկարողանան օգնել փրկել տոնը։
   Մկնիկներն առանց իրար հերթ տալու փորձում էին Ձմեռ պապիկին համոզել։ Իսկ փոքրիկ էլֆն այդ ընթացքում նայում էր շուրջը ու հիանում։
   – Ցանկացած էլֆի երազանքն է բարություն անել ու երեխաներին ուրախացնել։ Մինչ օրս մտածում էինք, ոնց դա իրագործենք։ Կարծես թե մեր երազանքը կարող է իրականություն դառնալ. . .
   Ձմեռ պապը ուշադիր հետևում էր, թե ինչ է կատարվում շուրջը ու արդեն կամաց-կամաց հասկանում էր իրականությունը։ Քանի որ պետք էր փրկել երեխաների սպասված հրաշքը, Ձմեռ պապը համաձայնեց ընդունել էլֆերի օգնությունը։


   Մկնիկների ու էլֆերի օգնությամբ Ձմեռ պապը շատ արագ կարողացավ կազմակերպել ամեն ինչ։ Մկները նամակներն էին արագ դասավորում, էլֆերը՝ նվերները պատրաստում։
   Տոնը փրկված էր։ Երեխաների սպասված հրաշքը իրականանալու էր։
   Երբ հնչեցին ժամացույցի զանգերը, երբ բոլոր կողմերից լսվեց «Շնորհավոր Նոր տարի» բացականչությունները, երեխաներն իրենց բարձերի կամ տոնածառի տակ հայտնաբերեցին իրենց այդքան սպասված նվերները։
   Ձմեռ պապը ոգևորությունից ապաքինվել էր, էլֆերը՝ ուրախությունից իրենց տեղը չէին գտնում, իսկ մկները ուրախ ծվծվում էի ու հպարատանում իրենցով։


   Երբ եկավ Նոր տարին ու բոլոր երեխաներն իրենց նվերները ստացան, էլֆերը տխրեցին։ Նրանց շատ էր դուր եկել Ձմեռ պապի օգնական լինելը։ Ձմեռ պապն էլ տխրեց, որ միգուցե էլֆերը չուզենան էլ իր հետ աշխատել։ Բայց մենակով աշխատել ու նվերներ պատրաստել նա այլևս չէր կարող։ Ծեր էր արդեն ու իրեն օգնականներ էին պետք։ Եվ որպեսզի նորից եկող տարում չհիվանդանար, որոշեց խնդրել էլֆերին, որպեսզի նրանք դառնան իր օգնականները։ Էլֆերը սիրով համաձայնեցին։ Նրանց կախարդական երկիրը դարձավ նվերների մեծ գործարան և նրանք ժրաջան մեղուների նման սկսեցին նվերներ պատրաստել։
   Ձմեռ պապն այլևս միայնակ չէր։ Նա օգնականներ ուներ արդեն՝ էլֆերին ու նաև լավ բարեկամներ՝ մկնիկներին։
   Այսուհետ Հրաշք տոնը վտանգված չէր. . .
"""
            ,
            author: "Վերոնիկա Բուռնուչյան",
            timeToRead: 25,
            ageGroup: .elementary,
            tags: ["ԱՄԱՆՈՐ","ԷԼՖ","ՀԵՔԻԱԹ","ՁՄԵՌ ՊԱՊ","ՄՈՒԿ","ՆՈՐ ՏԱՐԻ"]
        ),
        Tale(
            title: "Նապաստակն ու ոզնին. Գրիմ եղբայրներ",
            content: """
    Ամռան մի առավոտ ոզնին դուրս եկավ դաշտ զբոսնելու: Նրան պատահեց նապաստակը:

    – Բարև, նապաստակ եղբայր, ո՞նց ես,- հարցրեց ոզնին:

    Իսկ նապաստակը, փոխանակ քաղաքավարի բարևելու, ասաց.

    – Այդպես վաղ ի՞նչ ես անում դաշտում, ոզնի:

    – Զբոսնում եմ:

    – Զբոսնո՞ւմ ես,- զարմացավ նապաստակը,- իմ կարծիքով քո այդ ծուռտիկ ոտներով շատ չես զբոսնի:

    – Դու կարծում ես, թե ինձնից արա՞գ կվազես,- հարցրեց ոզնին:

    – Իհարկե,- ծիծաղեց նապաստակը:

    – Փորձենք,- ասաց ոզնին:

    – Փորձենք,- ծիծաղեց նապաստակը:

    – Դե այստեղ քիչ սպասիր, գնամ տուն, նախաճաշեմ, գամ: Լա՞վ:

    – Լավ:

    Ոզնին վազեց տուն և կնոջն ասաց.

    – Կնիկ, շուտով շորերդ հագիր, պետք է դաշտ գնանք:

    – Ի՞նչ կա որ,- հարցրեց կինը:

    – Նապաստակի հետ գրազ եմ եկել, թե ո՞վ ավելի արագ կվազի: Դու պետք է ինձ օգնես:

    – Գժվե՞լ ես, ինչ է: Դու ո՞նց կարող ես նապաստակից առաջ անցնել:

    – Քո գործը չէ: Ես գիտեմ, թե ինչ եմ անում:

    Կինը շորերը հագավ, և նրանք դաշտ գնացին: Ճանապարհին ոզնին կնոջն ասաց.

    – Այ, այս դաշտով պետք է վազենք: Ես մի ակոսով, նապաստակը մյուս ակոսով: Դա մի ակոսի ծայրին նստիր, երբ նապատակը վազելով կգա քեզ մոտ, հանկարծ դուրս եկ և գոռա. «Ես արդեն այստեղ եմ»: Հասկացա՞ր:

    – Հասկացա,- ասաց ոզնու կինը:

    Իսկ ոզնին ու իր կինը այնպես նման էին իրար, ոնց որ ջրի երկու կաթիլ:

    Այդ ժամանակ նապաստակը եկավ:

    – Դե, վազենք,- ասաց նա:

    – Վազենք:

    – Մե՛կ, երկո’ւ, երե’ք:

    – Վազենք:

    Ոզնին մի քանի քայլ վազեց, ապա կամաց ետ դարձավ և իր տեղում հանգիստ նստեց: Երբ նապաստակը հասավ ակոսի ծայրին, հանկարծ ոզնու կինը դուրս եկավ ա գոչեց.

    – Իսկ ես արդեն այստեղ եմ:

    Շատ զարմացավ նապաստակը, որ ոզնին հաղթեց իրեն, և բարկացած գոչեց.

    – Էլի վազենք: Մեկ, երկու, երեք,- և քամու նման վազեց:

    Երբ որ տեղ հասավ, հանկարծ ոզնին դուրս եկավ և գոչեց.

    – Իսկ ես արդեն այստեղ եմ:

    – էլի վազենք,- բարկացավ նապաստակը: էլի վազեցին:

    Նապաստակն այնքան այս ու այն կողմ վազեց, որ ուժասպառ եղավ:

    – Դու ինձ հաղթեցիր,- ասաց նապաստակը և գլուխը կախ հեռացավ:
"""
            ,
            author: "Լավ հեքիաթներ",
            timeToRead: 25,
            ageGroup: .elementary,
            tags: ["ՀԵՔԻԱԹ","ՆԱՊԱՍՏԱԿ","ՈԶՆԻ"]
        ),
        Tale(
            title: "Փոքրիկ պանդան",
            content: """
    Բամբուկենիների մեջ ապրում էր պանդաների ընտանիքը՝ հայր պանդան, մայր պանդան և դուստր պանդան։ Երբեմն փոքրիկ պանդան ձանձրանում էր և շատ էր ուզում ընկերներ ունենալ։ Ոչ շատ հեռվում ապրում էր եղջերուների ընտանիքը՝ մայր եղջերուն, հայր եղջերուն և երկու փոքրիկ եղնիկները։ Եղնիկներն ամբողջ օրը խաղում էին միամյանց հետ ու վազվզում մարգագետնում։
    – Եկեք ընկերներ լինենք,- առաջարկեց փոքրիկ պանդան։
    – Ինչի՞ համար քեզ հետ ընկերանանք։ Դու մեզ նման չես,- պատասխանեց մի եղնիկը։- Դու մեզ նման արագ վազել ու թռչկոտել չգիտես։ Կճղակների փոխարեն դու մագիլներ ունես։
    – Դու միայն բամբուկ ուտել ու ծառերի վրա մագլցել գիտես,- ասաց մյուս եղնիկը։
    Եվ նրանք շտապեցին հեռանալ պանդայից և խաղալ միայն միմյանց հետ։
    Տխրեց պանդան, լացեց ու գնաց ծնողների մոտ.
    – Եղնիկները չեն ուզում ինձ հետ ընկերանալ,- ասաց պանդան,- քանի որ ես իրենց նման չեմ։ Ուրեմն ես ավելի՞ վատն եմ, քան նրանք։
    – Եթե դու նրանց նման չես, դա չի նշանակում, որ դու վատն ես,- պատասխանեց մայր պանդան։
    – Լավ ընկեր լինելու համար բացարձակապես պարտադիր չէ իմանալ այն, ինչ գիտեն մյուսները,- ասաց հայր պանդան։
    Մի անգամ դժբախտություն տեղի ունեցավ։ Եղնիկներն անտառում, իրար հետևից վազելով, ընկան որսորդների փորած փոսը։ Ինչքան նրանք փորձեցին փոսից դուրս գալ, չկարողացան։ Նույնիսկ թռչկոտելը չօգնեց նրանց։ Նրանց ծնողները կանգնել էին փոսի եզրին և ոչ մի բանով չէին կարող օգնել իրենց ձագուկներին։ Փոսը շատ խորն էր։
    Պանդան եղնիկներին տեսավ փոսի մեջ ու վազեց տուն՝ օգնություն կանչելու։
    – Եղնիկների հետ դժբախտություն է պատահել։ Մենք պետք է նրանց օգնենք,- բացականչեց նա։ – Մեզ ամուր բամբուկի ձողեր ու լիանաներ են պետք։
    Հայր պանդան բամբուկի ձողեր հանեց, իսկ մայր պանդան՝ իր սուր ճիրաններով ճկուն լիանաներ կտրատեց։ Եվ նրանք բոլորով գնացին դեպի փոսը։
    Փոքրիկ պանդան իջավ փոսի մեջ և լիանաների օգնությամբ եղնիկներին կապեց բամբուկներին։ Նա դա հեշտությամբ արեց։ Իսկ եղնիկները չէին կարող իրար կապել, քանի որ նրանք մագիլների փոխարեն կճղակներ ունեին։
    Իսկ վերևից մեծ պանդաներն ու եղջերուները միասին սկսեցին դուրս քաշել բամբուկները, որոնց կապված էին եղնիկները։ Եվ հերթով եղնիկներին դուրս բերեցին փոսից։
    Եղնիկները չգիտեին ինչպես իրենց շնորհակալությունը հայտնեն պանդաներին։ Նրանք մոտեցան փոքրիկ պանդային։
    – Ինչ լավ է, որ դու մեզ նման չես,- ասաց մի եղնիկը։ – Եվ շատ լավ է, որ կճղակների փոխարեն դու մագիլներ ունես։
    – Եվ շատ լավ է, որ դու կարողանում ես ծառերի վրա մագլցել, – ասաց մյուսը։
    Եղնիկներն արդեն իրենք էին ուզում ընկերանալ փոքրիկ պանդայի հետ։ Եվ այդ օրվանից նրանք դարձան անբաժան ընկերներ։ Հետո՞ ինչ, որ պանդան չէր կարողանում արագ վազել ու թռչկոտել։ Փոխարենը նա խելացի էր, բարի և ուրախ։ Իսկ եղնիկներն իրենք էլ հասկացան այն, ինչ պանդային ասել էին նրա ծնողները. ընկերներ լինելու համար պարտադիր չէ բոլորին իրար նման լինել։
"""
            ,
            author: "Լավ հեքիաթներ",
            timeToRead: 15,
            ageGroup: .elementary,
            tags: ["ԵՂՆԻԿ","ԸՆԿԵՐՈՒԹՅՈՒՆ","ՀԵՔԻԱԹ","ՊԱՆԴԱ"]
        ),
    ]
    
    static func getAllTales() -> [Tale] {
        tales
    }
    
    // Получение сказок по возрастной группе
    static func getTales(forAgeGroup ageGroup: AgeGroup) -> [Tale] {
        tales.filter { $0.ageGroup == ageGroup }
    }
    
    // Поиск сказок по тегам
    static func getTales(withTags tags: [String]) -> [Tale] {
        tales.filter { tale in
            tags.contains { tag in
                tale.tags.contains(tag)
            }
        }
    }
    
    // Поиск сказок по названию
    static func searchTales(byTitle searchText: String) -> [Tale] {
        tales.filter { $0.title.lowercased().contains(searchText.lowercased()) }
    }
}
