//
//  AllLetters.swift
//  HayLingo
//
//  Created by Karen Vardanian on 06.12.2024.
//

import Foundation


struct AllLetters {
    static let armenianAlphabet = ["Ա", "Բ", "Գ", "Դ", "Ե", "Զ", "Է", "Ը", "Թ", "Ժ", "Ի", "Լ", "Խ", "Ծ", "Կ", "Հ", "Ձ", "Ղ", "Ճ", "Մ", "Յ", "Ն", "Շ", "Ո", "Չ", "Պ", "Ջ", "Ռ", "Ս", "Վ", "Տ", "Ր", "Ց", "Ու", "Փ", "Ք", "Եվ", "Օ", "Ֆ", "Ա-Ֆ"]
    static let russianAlphabet = ["а", "б", "г", "д", "е", "з", "э", "ы/э", "т‘", "ж", "и", "л", "х", "тц", "к", "h", "дз", "гх", "тч", "м", "й", "н", "ш", "во", "ч", "п", "дж", "р", "с", "в", "т", "р‘", "ц", "у", "п‘", "к‘", "ев", "о", "ф", "а-ф"]
    static let englishAlphabet = ["a", "b", "g", "d", "e", "z", "ē", "ə", "t‘", "ž", "i", "l", "x", "c", "k", "h", "j", "ł", "č", "m", "y", "n", "š", "o", "č‘", "p", "ǰ", "r̄", "s", "v", "t", "r", "c‘", "w", "p‘", "k‘", "ev", "ô", "f", "a-f"]
}
